[
    {
      "title": "Software Engineer - 1 | Microsoft",
      "company": "microsoft",
      "rounds": [
        {
          "round": 1,
          "title": "Online Coding Interview",
          "problems": 2,
          "body": [
            "A thief plans to rob a store and can carry a maximum weight of ‘W’ in his knapsack. Inside the store, there are ‘N’ different items, and the thief knows both the weight and value of each one. Keeping in mind the weight limit of the knapsack, your task is to determine the maximum profit the thief can make by selecting a combination of these items.\n\nNote: The thief cannot break an item — he must either take it whole or leave it behind.\n\nExample:\nIf N = 4, W = 10, and the item details are:\nweights = [6, 1, 5, 3] and values = [3, 6, 1, 4],\nthe most profitable selection would be items with weights 6, 1, and 3.\nThis would fill the knapsack with a total value of 3 + 6 + 4 = 13.",
            "You are given an undirected graph consisting of ‘V’ vertices (numbered from 0 to V-1) and ‘E’ edges. Each edge connects two nodes, say ‘X’ and ‘Y’, and has an associated weight representing the distance between them.\n\nYour task is to calculate the shortest distance from the source node (node labeled 0) to every other vertex in the graph.\n\nExample:\nIf you have a graph with V = 4 and the following edges:\n(0, 1, 5)\n(0, 2, 3)\n(1, 2, 2)\n(1, 3, 6)\n(2, 3, 7)\n\nThis means:\nNode 0 is connected to Node 1 with a weight of 5\nNode 0 is connected to Node 2 with a weight of 3\nAnd so on…\n\nThe shortest distances from node 0 to all other nodes would be:\nDistance to 0: 0\nDistance to 1: 5\nDistance to 2: 3\nDistance to 3: 10"
          ]
        },
        {
          "round": 2,
          "title": "Technical Round 1",
          "problems": 3,
          "body": [
            "Implement a function to merge overlapping intervals. Extend it to return the number of merged intervals as well.",
            "What if the intervals are coming as a stream?",
            "Shortest Path with some variations. Included an overview of Dijkstra's, Bellman-Ford, and Floyd-Warshall algorithm"
          ]
        },
        {
          "round": 3,
          "title": "Technical Round 2",
          "problems": 5,
          "body": [
            "In-depth discussion over the skills and projects mentioned in the resume.",
            "Questions over computer fundamentals including OOPs concepts and DBMS.",
            "What is Normalization in DBMS?",
            "What is the difference between static and dynamic polymorphism?",
            "You are given an array of integers of length 'n' and an integer 'target'. Return all pair of elements which add upto 'target'."
          ]
        },
        {
          "round": 4,
          "title": "Hiring Manager Round",
          "problems": 3,
          "body": [
            "Tell me about a time you disagreed with a team member.",
            "How do you prioritize tasks under tight deadlines?",
            "Tell me about a time you went above and beyond for a client."
          ]
        }
      ],
      "selected": true,
      "user": "anonymous",
      "date": "2025-04-08"
    },
    {
      "title": "SDE-2 | Amazon",
      "company": "amazon",
      "rounds": [
        {
          "round": 1,
          "title": "Online Assessment",
          "problems": 3,
          "body": [
            "You are given a list of integers. Write a function to find the maximum sum of a subsequence such that no two numbers are adjacent.",
            "Design a class for a voting system where each state has multiple political parties. Implement methods to update votes and retrieve the leading party in constant time.",
            "Given a list of ratios between variables, answer queries about the ratio between two variables. For example, if A/B = 0.5 and B/C = 2, what is A/C?"
          ]
        },
        {
          "round": 2,
          "title": "Technical Interview 1",
          "problems": 3,
          "body": [
            "Implement a function to find all nodes at distance K from a given node in a binary tree.",
            "Design classes for a chess game, detailing the relationships between pieces, the board, and game rules.",
            "Explain how you would design a system to track the last read page in an e-book across multiple devices, considering offline scenarios."
          ]
        },
        {
          "round": 3,
          "title": "Technical Interview 2",
          "problems": 2,
          "body": [
            "Design a system to aggregate movie reviews from multiple sources like IMDb and Rotten Tomatoes. Discuss data consistency and ranking strategies.",
            "Given a list of sorted arrays, write an algorithm to select one element from each array such that the difference between the maximum and minimum selected elements is minimized."
          ]
        },
        {
          "round": 4,
          "title": "Behavioral Interview",
          "problems": 3,
          "body": [
            "Describe a time when you took initiative to improve a process or product.",
            "Tell me about a situation where you disagreed with a team member. How did you handle it?",
            "Give an example of how you demonstrated customer obsession in your previous roles."
          ]
        }
      ],
      "selected": true,
      "user": "anonymous",
      "date": "2025-04-12"
    },
    {
      "title": "Data Analyst | Flipkart",
      "company": "flipkart",
      "rounds": [
        {
          "round": 1,
          "title": "Aptitude and Technical Screening",
          "problems": 3,
          "body": [
            "Aptitude Test: Questions on logical reasoning and quantitative aptitude, such as percentage calculations and time-speed-distance problems.",
            "SQL Querying: Write SQL queries to retrieve specific data from a given database schema.",
            "Excel Proficiency: Tasks involving pivot tables, VLOOKUP, and data analysis functions."
          ]
        },
        {
          "round": 2,
          "title": "Technical Interview 1",
          "problems": 3,
          "body": [
            "Python Programming: Demonstrate the use of pandas for data manipulation, including merging datasets and applying conditional filters.",
            "Advanced Excel: Solve problems using SUMIFS, dynamic arrays, and other complex Excel functions.",
            "Data Interpretation: Analyze a dataset to extract meaningful insights and present findings."
          ]
        },
        {
          "round": 3,
          "title": "Technical Interview 2",
          "problems": 2,
          "body": [
            "Power BI: Design a sample dashboard to visualize key performance indicators (KPIs) relevant to e-commerce.",
            "Case Study: Given a scenario, outline the steps to analyze sales data and identify trends affecting business performance."
          ]
        },
        {
          "round": 4,
          "title": "Managerial Round",
          "problems": 2,
          "body": [
            "Describe a challenging data analysis project you've worked on and how you overcame obstacles.",
            "How do you prioritize tasks when handling multiple data analysis projects with tight deadlines?"
          ]
        }
      ],
      "selected": true,
      "user": "anonymous",
      "date": "2025-04-12"
    },
    {
      "title": "SDE-III | Apple",
      "company": "apple",
      "rounds": [
        {
          "round": 1,
          "title": "Recruiter Screening",
          "problems": 1,
          "body": [
            "The recruiter reviewed my resume and discussed my background, experience, and motivation for applying to Apple.\n\nI was asked about my interest in Apple and how my skills align with the SDE-III role.\n\nThe recruiter provided an overview of the interview process and next steps."
          ]
        },
        {
          "round": 2,
          "title": "Technical Phone Interview 1",
          "problems": 2,
          "body": [
            "I was asked to solve a coding problem involving dynamic programming. The problem was similar to the 'Jump Game II' problem on LeetCode.",
            "The interviewer assessed my problem-solving approach, code efficiency, and ability to handle edge cases.\n\nI was also asked to explain the time and space complexity of my solution."
          ]
        },
        {
          "round": 3,
          "title": "Technical Phone Interview 2",
          "problems": 2,
          "body": [
            "The interviewer presented a system design question: 'Design a scalable notification system for a high-traffic application.\n\nI discussed various components such as message queues, databases, and API design.",
            "The interviewer evaluated my understanding of system scalability, reliability, and fault tolerance."
          ]
        },
        {
          "round": 4,
          "title": "On-site Interviews",
          "problems": 3,
          "body": [
            "The on-site consisted of multiple rounds, including coding challenges, system design discussions, and behavioral interviews.\n\nIn one coding round, I was asked to implement an LRU Cache and discuss its time complexity.",
            "In a system design round, I was asked to design a microservices architecture for a large-scale e-commerce platform, considering aspects like service communication, data consistency, and deployment strategies.",
            "Behavioral interviews focused on my leadership experiences, problem-solving abilities, and alignment with Apple's values."
          ]
        },
        {
          "round": 5,
          "title": "Final Interview",
          "problems": 1,
          "body": [
            "The final interview involved discussions with senior leadership and HR representatives.\n\nTopics included my long-term career goals, cultural fit within Apple, and potential contributions to the team.\n\nI was given the opportunity to ask questions about Apple's engineering culture, team dynamics, and upcoming projects."
          ]
        }
      ],
      "selected": true,
      "user": "anonymous",
      "date": "2025-04-12"
    },
    {
      "title": "SDE-1 | Amazon",
      "company": "amazon",
      "rounds": [
        {
          "round": 1,
          "title": "Online Assessment",
          "problems": 3,
          "body": [
            "The first coding question involved implementing a function to find the Kth smallest element in an unsorted array. I used the Quickselect algorithm to solve it efficiently.",
            "The second coding question was related to dynamic programming, where I had to find the maximum sum of non-adjacent elements in an array. I implemented a bottom-up dynamic programming solution.",
            "The work style assessment included multiple-choice questions to assess my alignment with Amazon's leadership principles, such as customer obsession and ownership."
          ]
        },
        {
          "round": 2,
          "title": "Technical Interview 1",
          "problems": 2,
          "body": [
            "The first problem was to implement a function to detect a cycle in a directed graph using Depth-First Search (DFS). I solved it by marking nodes as visited and checking for back edges.",
            "The second problem was to implement a function to merge two sorted linked lists. I used a two-pointer approach to merge the lists iteratively. \nThe interviewer also asked me to explain the time and space complexity of my solutions and discuss edge cases."
          ]
        },
        {
          "round": 3,
          "title": "Technical Interview 2",
          "problems": 2,
          "body": [
            "The system design question was to design a URL shortening service like bit.ly. I discussed the components such as the database schema, hash function for generating short URLs, and handling collisions.",
            "The behavioral questions were based on Amazon's leadership principles. I used the STAR (Situation, Task, Action, Result) method to structure my responses."
          ]
        },
        {
          "round": 4,
          "title": "Final Round (Bar Raiser)",
          "problems": 2,
          "body": [
            "The final round included a technical interview with a senior engineer and a behavioral interview with a Bar Raiser.\n\nThe technical interview involved solving a problem related to designing an LRU (Least Recently Used) cache. I discussed the data structures involved and implemented the solution using a doubly linked list and a hash map.",
            "The behavioral interview focused on my experiences and how they aligned with Amazon's leadership principles. I was asked to provide examples of how I demonstrated ownership and delivered results in my previous roles.\n\nThe Bar Raiser emphasized the importance of cultural fit and evaluated my potential to thrive at Amazon."
          ]
        }
      ],
      "selected": false,
      "user": "anonymous",
      "date": "2025-04-12"
    },
    {
      "title": "Software Engineer I",
      "company": "cisco",
      "rounds": [
        {
          "round": 1,
          "title": "Online Assessment",
          "problems": 2,
          "body": [
            "Given an array of integers, find the largest sum of non-adjacent numbers.",
            "Implement a function to find duplicates in a one-dimensional array."
          ]
        },
        {
          "round": 2,
          "title": "Technical Interview 1",
          "problems": 3,
          "body": [
            "Design a system that can remind users of medication expiration dates.",
            "Explain the working of DHCP and discuss pointer arithmetic in C.",
            "Solve the 'rainwater trapping' problem using appropriate data structures."
          ]
        },
        {
          "round": 3,
          "title": "Managerial Interview",
          "problems": 2,
          "body": [
            "Discuss a challenging project you've worked on and how you overcame obstacles.",
            "How do you approach problem-solving when faced with unfamiliar technologies?"
          ]
        },
        {
          "round": 4,
          "title": "HR Interview",
          "problems": 2,
          "body": [
            "Why do you want to work at Cisco?",
            "Are you comfortable with the job location and work schedule?"
          ]
        }
      ],
      "selected": true,
      "user": "anonymous",
      "date": "2025-04-12"
    },
    {
      "title": "Application Engineer - I",
      "company": "flipkart",
      "rounds": [
        {
          "round": 1,
          "title": "Online Assessment",
          "problems": 2,
          "body": [
            "You are given a log of user sign-ins and sign-outs with timestamps. Implement a function to calculate the peak number of concurrent users at any given time.",
            "Given a string and a dictionary of words, segment the string into a space-separated sequence of dictionary words. Return all such possible segmentations."
          ]
        },
        {
          "round": 2,
          "title": "Technical Interview",
          "problems": 2,
          "body": [
            "Design a backend service to handle product search suggestions in real-time as a user types. Discuss autocomplete logic, indexing, and API structure.",
            "You are given a nested JSON object representing order details. Write a parser to flatten it into key-value pairs using dot notation for nested keys."
          ]
        },
        {
          "round": 3,
          "title": "Managerial Round",
          "problems": 2,
          "body": [
            "Tell me about a time you handled a last-minute production issue. What was your approach and the outcome?",
            "How do you manage feature delivery when requirements keep changing from stakeholders?"
          ]
        },
        {
          "round": 4,
          "title": "HR Round",
          "problems": 2,
          "body": [
            "What motivates you to work in a high-paced e-commerce environment like Flipkart?",
            "Where do you see yourself in the next 3 years, and how does this role align with your career goals?"
          ]
        }
      ],
      "selected": false,
      "user": "anonymous",
      "date": "2025-04-12"
    },
    {
      "title": "SDE - 1 at Phonepe",
      "company": "phonepe",
      "rounds": [
        {
          "round": 1,
          "title": "Technical Round I",
          "problems": 2,
          "body": [
            "You're given a set of n stones, each placed at unique integer coordinates on a 2D plane. Each coordinate holds at most one stone.\n\nA stone can be removed if there is at least one other stone in the same row or the same column that hasn't been removed yet.\n\nYou are given an array stones where stones[i] = [ri, ci] represents the position of the i-th stone. Your task is to return the maximum number of stones that can be removed under these rules.\n\nExample:\nInput:\nstones = [[0, 1], [1, 0], [0, 0]]\n\nOutput:\n2\n\nExplanation:\nRemove the stone at [0, 1] since it shares the same row with [0, 0].\nRemove the stone at [1, 0] since it shares the same column with [0, 0].\nThe stone at [0, 0] cannot be removed, as no other stones remain in its row or column.",
            "You are given an array 'A' of length 'N' containing integers.\nDetermine if there exist three indices 'i', 'j', and 'k' such that 0 <= 'i' < 'j' < 'k' < 'N' and 'A[i]' < 'A[k]' < 'A[j]'."
          ]
        },
        {
          "round": 2,
          "title": "Technical Round II",
          "problems": 2,
          "body": [
            "You are given the number of machines 'N', an array 'M' of length 'N' where 'M[i]' represents the number of days the i-th machine takes to produce one item, and the total number of items 'O' that need to be ordered.\n\nReturn the minimum number of days required for all machines working in parallel to complete the order.",
            "You are given an integer ‘N’, which denotes there are ‘N’ friends. You are supposed to form some pairs them satisfying the following conditions:\n1. Each friend can be paired with some other friend or remain single.\n2. Each friend can be a part of at most one pair.\n\nYou are supposed to find the total number of ways in which the pairing can be done satisfying both conditions. Since the number of ways can be quite large, you should find the answer modulo 1000000007(10^9+7).\n\nNote:\n1. Return the final answer by doing a mod with 10^9 + 7.\n2. Pairs {A, B} and {B, A} are considered the same."
          ]
        },
        {
          "round": 3,
          "title": "Managerial Round",
          "problems": 1,
          "body": [
            "This round was conducted by the Hiring Manager, who currently serves as an Engineering Manager at PhonePe with over seven years of experience. He came across as humble and approachable. After a brief and formal introduction, he provided an overview of the interview’s context and objectives.\nThe primary focus was to understand my previous work experience, discuss my expectations from the role and the organization, and offer insights into what the company seeks in a potential candidate. It was a well-balanced round centered on cultural alignment and team compatibility, aiming to assess mutual fit in terms of work style, values, and expectations."
          ]
        }
      ],
      "selected": true,
      "user": "anonymous",
      "date": "2025-04-12"
    },
    {
      "title": "SDE - III (Java)",
      "company": "walmart",
      "rounds": [
        {
          "round": 1,
          "title": "DS Round (Tree, Heap, LinkList)",
          "problems": 3,
          "body": [
            "Given a Binary Tree, the task is to print the Level order traversal of the Binary Tree in spiral form i.e, alternate order.",
            "Given a Binary Search Tree (BST) and a positive integer k, find the kth smallest element in the Binary Search Tree.",
            "To reverse linkList and some questions around heap ( what is min heap and max heap)"
          ]
        },
        {
          "round": 2,
          "title": "DS + Technical Round",
          "problems": 3,
          "body": [
            "It was asked around stacks how the stack works and basic programming around the stack.",
            "It was around Normal and Priority queues. Basic programme about the queue.",
            "Lamdas & How does hashmap work at the backend, which ds is used to implement hashmap? And much more questions were about Memory management and Garbage collection"
          ]
        },
        {
          "round": 3,
          "title": "LLD Round",
          "problems": 2,
          "body": [
            "I was asked to design a system that helps to plan events with available rooms and time of people. It was similar to how we book rooms on Outlook and it shows whether a person is available to attend the event.",
            "I was asked to design a database, write Basic API and query to test SQL knowledge."
          ]
        },
        {
          "round": 3,
          "title": "Behavioural Round",
          "problems": 2,
          "body": [
            "This round was just a managerial round in which some behavioural questions were asked, Also explained the project on which I will be working etc.",
            "The hr round was also done on the same day and finally, I got an update after a week I was selected."
          ]
        }
      ],
      "selected": true,
      "user": "anonymous",
      "date": "2025-04-12"
    },
    {
      "title": "SWE - III",
      "company": "google",
      "rounds": [
        {
          "round": 1,
          "title": "Technical Phone Screening",
          "problems": 1,
          "body": [
            "Suppose you are working on Google Photos. you are wring the client application. Request comes to you to upload N photos. you fire the request to server to upload those N photos to server. Then the server responds back with acknowledgements that a particular photo is uploaded. Example. Suppose you are uploading 10 Photos, The server can respond back in any order, such as 1,2,4,5,3,7,6,10,9,8 . Now at any given point of time we need to check what is the maximum photo number which has been uploaded continously."
          ]
        },
        {
          "round": 2,
          "title": "Technical Round 1",
          "problems": 1,
          "body": [
            "There is a Line (Like X axis) which we need to paint. you are given a list of pairs which is needs to be painted, such as (4, 10), (7, 13), (16,20), (1, 40). There is a cost to paint a particular area which is equal to the distance. Such as for (4, 10) the cost is 10 - 4 = 6. and so on. you have write the code to calculate the cost required to paint each of the given pairs. note that if the area is already painted once, no need to paint it again."
          ]
        },
        {
          "round": 3,
          "title": "Technical Round 2",
          "problems": 1,
          "body": [
            "There are some house in a cicular street. each house is connected to its neighbours, on each house you are allowed to do the below operations:\n\nvoid openDoor()\nvoid closeDoor()\nboolean isDoorOpen()\nHouse moveRight()\nHouse moveLeft()\n\nSuppose Initially, it is given that all the House doors are closed. and you are standing at one random house. and you have to count the total number of houses in the Circle. (by moving to the right or left) . how will you count the number of houses?"
          ]
        },
        {
          "round": 3,
          "title": "Technical Round 3",
          "problems": 1,
          "body": [
            "There is a Hospital which contain N rooms from 1 to N -1. There is a Queue of Patients outside the Hospital. Each patient will be served in a single room and each patient has a time duration that it will take for the treatment. The rooms are allocated to patients by the lowest index (if the room is free). Initially room1 will be given to the patient, then if the 2nd patient comes and the 1st room is still busy, then the room2 will be given to the 2nd patient. now suppose the 1st patient treatment is completed, and the room1 is free now, and a new patient comes, then room1 will be given to the new patient. Each Patient has a start time also (Consider this as appointment time for him, it needs not to be a time format, use Integer for this). \n\nThe patients standing in the queue are in non decreasing order of their start time. means if the first patient start time = 1, then the second patient start time will be >= 1. Now the rooms will be allocated to each patients one by one. we have to calculate that by the end when all the patients are treatment done, Which is the room in which the maximum no of patients have been entered?"
          ]
        },
        {
          "round": 3,
          "title": "Googlyness Round",
          "problems": 5,
          "body": [
            "Introduce yourself",
            "If you're asked to build a system but the product requirements are incomplete or unclear, how would you approach the situation and move forward with development?",
            "Can you share some challenges you encountered while trying to extend or enhance an existing system? How did you address them?",
            "If a manager makes an unreasonable request — for example, asking you to meet an unrealistic deadline or work overnight — how would you handle and respond to that situation?",
            "Imagine you're tasked with training a model for Google Photos to detect whether a person is smiling in a picture. What kind of data would you need to effectively train this model? What types of images would be essential for this task?"
          ]
        }
      ],
      "selected": true,
      "user": "anonymous",
      "date": "2025-04-12"
    },
    {
      "title": "Software Engineer",
      "company": "goldman-sachs",
      "rounds": [
        {
          "round": 1,
          "title": "Online Assessment",
          "problems": 2,
          "body": [
            "Similar to Coin Change problem (Dynamic Programming).",
            "There is a matrix of size m * n. The elements in matrix are populated with values 1 and 0. 1 indicates in establishing connection and 0 indicates not establishing connection. We need to connect the available adjacent positions vertically, horizontally and diagonally and count the number of distinct connections established"
          ]
        },
        {
          "round": 2,
          "title": "Technical Round",
          "problems": 2,
          "body": [
            "Given a string s of lowercase English letters, the task is to find the first non-repeating character. If there is no such character, return ‘$’.",
            "There is a robot on an m x n grid. The robot is initially located at the top-left corner (i.e., grid[0][0]). The robot tries to move to the bottom-right corner (i.e., grid[m - 1][n - 1]). The robot can only move either down or right at any point in time. Given the two integers m and n, return the number of possible unique paths that the robot can take to reach the bottom-right corner."
          ]
        },
        {
          "round": 3,
          "title": "Technical Interview",
          "problems": 4,
          "body": [
            "Introduction",
            "Questions related to Java and related Java8 features",
            "How to find duplicate elements in list using Streams API.",
            "There are n gas stations along a circular route, where the amount of gas at the ith station is gas[i]. You have a car with an unlimited gas tank and it costs cost[i] of gas to travel from the ith station to its next (i + 1)th station. You begin the journey with an empty tank at one of the gas stations. Given two integer arrays gas and cost, return the starting gas station's index if you can travel around the circuit once in the clockwise direction, otherwise return -1."
          ]
        },
        {
          "round": 3,
          "title": "Technical Interview",
          "problems": 2,
          "body": [
            "OOPs concept",
            "Stickler the thief wants to loot money from the houses arranged in a line. He cannot loot two consecutive houses and aims to maximize his total loot. Given an array, arr[] where arr[i] represents the amount of money in the i-th house. Determine the maximum amount he can loot."
          ]
        },
        {
          "round": 3,
          "title": "Technical Interview",
          "problems": 4,
          "body": [
            "Introduction",
            "Previous work experience and tech stack",
            "Design questions related to the projects mentioned in my resume",
            "Design something which does some operations using Multithreading"
          ]
        },
        {
          "round": 3,
          "title": "HM Round",
          "problems": 5,
          "body": [
            "Introduction",
            "Previous work experience and tech stack",
            "Contributions at previous companies",
            "Asked to Design Twitter, in high-level",
            "Any knowledge about AI/ML and Cloud"
          ]
        }
      ],
      "selected": true,
      "user": "anonymous",
      "date": "2025-04-12"
    },
    {
        "title": "SDE 1 | Oracle",
        "company": "oracle",
        "rounds": [
          {
            "round": 1,
            "title": "Online Assessment",
            "problems": 4,
            "body": [
              "A 90-minute test comprising multiple-choice questions on computer science fundamentals, including networking, operating systems, and data structures.",
              "One coding problem involving the reversal of a linked list.",
              "A puzzle question: 'You bought a book for 10 Rs and sold it for 15 Rs, then bought it again for 20 Rs and sold it for 25 Rs. What is the total profit?",
              "A question on SQL queries, such as 'How to delete duplicates in a table?"
            ]
          },
          {
            "round": 2,
            "title": "Technical Interview 1",
            "problems": 3,
            "body": [
              "Discussion on resume and past projects, focusing on the tech stack used.",
              "A coding problem: 'Write a function to merge overlapping intervals.",
              "A question on object-oriented programming concepts: 'What is the difference between static and dynamic polymorphism?"
            ]
          },
          {
            "round": 3,
            "title": "Technical Interview 2",
            "problems": 3,
            "body": [
              "A coding problem: 'You are given an array of integers of length 'n' and an integer 'target'. Return all pairs of elements that add up to 'target'.",
              "A question on database management systems: 'What is normalization in DBMS?",
              "A question on computer networks: 'What is the difference between HTTP and HTTPS?"
            ]
          },
          {
            "round": 4,
            "title": "Hiring Manager Round",
            "problems": 3,
            "body": [
              "Tell me about a time you disagreed with a team member.",
              "How do you prioritize tasks under tight deadlines?",
              "Tell me about a time you went above and beyond for a client."
            ]
          }
        ],
        "selected": true,
        "user": "anonymous",
        "date": "2025-04-20"
      },
      {
        "title": "SDE 2 | Oracle",
        "company": "oracle",
        "rounds": [
          {
            "round": 1,
            "title": "Online Coding Interview",
            "problems": 3,
            "body": [
              "Theory Question - Which data structures is best suited for implementing a priority queue?",
              "What are the various types of joins in SQL",
              "Which algorithms is used to prevent deadlocks in Operating Systems? Explain"
            ]
          },
          {
            "round": 2,
            "title": "Online Coding Test",
            "problems": 3,
            "body": [
              "You are given the arrival times, the burst times and the priority of ‘N’ processes in a CPU. You need to find the order of process scheduling according to Priority Based CPU Scheduling. Along with the order, also find the individual waiting and turnaround time for all the processes in order of their schedule.\nNote:\n1. The processes are numbered from 1 to 'N'.\n2. The process with lowest arrival time will be scheduled first, followed by the next lowest arrival time, and so on.\n3. If any two processes have the same arrival time, then you have to run the process based on the priority of the process. The highest priority process will be scheduled first, followed by the next highest priority, and so on.\n4. If the two processes have the same priority, then you have to run the process with the lowest process number first.",
              "Implement Stack using Array. You have been given ‘m’ operations which you need to perform in the stack. Your task is to implement all the functions of the stack.",
              "You are given an integer array 'A' of size 'N', sorted in non-decreasing order. You are also given an integer 'target'. Your task is to write a function to search for 'target' in the array 'A'. If it exists, return its index in 0-based indexing. If 'target' is not present in the array 'A', return -1."
            ]
          },
          {
            "round": 3,
            "title": "Online Coding Test",
            "problems": 2,
            "body": [
              "SQL query in MySQL that demonstrates how to join two tables based on a common column",
              "You are given an array 'arr' of length 'n', consisting of integers.\nA subarray is a contiguous segment of an array. In other words, a subarray can be formed by removing 0 or more integers from the beginning and 0 or more integers from the end of an array.\nFind the sum of the subarray (including empty subarray) having maximum sum among all subarrays.\nThe sum of an empty subarray is 0."
            ]
          },
          {
            "round": 4,
            "title": "HR Round",
            "problems": 2,
            "body": [
              "What motivated you to pursue a career in software development, and what led you to specialize in your particular area of expertise?",
              "Can you share a challenging project you worked on, how you handled the obstacles, and what you learned that helped you grow as a developer?"
            ]
          }
        ],
        "selected": true,
        "user": "anonymous",
        "date": "2025-04-20"
      },
      {
        "title": "SDE 1",
        "company": "google",
        "rounds": [
          {
            "round": 1,
            "title": "Online Coding Test",
            "problems": 2,
            "body": [
              "You are given a positive integer 'N’. Your task is to find and return the minimum number of steps that 'N' has to take to get reduced to 1.\n\nYou can perform any one of the following 3 steps:\n\n1) Subtract 1 from it. (n = n - ­1) ,\n2) If n is divisible by 2, divide by 2.( if n % 2 == 0, then n = n / 2 ) ,\n3) If n is divisible by 3, divide by 3. (if n % 3 == 0, then n = n / 3 ).\nFor example:\n\nGiven:\n‘N’ = 4, it will take 2 steps to reduce it to 1, i.e., first divide it by 2 giving 2 and then subtract 1, giving 1.",
              "Given a string ’S’ consisting of lower case English letters, you are supposed to return the longest palindromic substring of ‘S’."
            ]
          },
          {
            "round": 2,
            "title": "Video Call",
            "problems": 2,
            "body": [
              "You are given a pattern in the form of a string and a collection of words. Your task is to determine if the pattern string and the collection of words have the same order.\nNote :\nThe strings are non-empty.\nThe strings only contain lowercase English letters.",
              "You are given a stream of 'N' integers. For every 'i-th' integer added to the running list of integers, print the resulting median. Print only the integer part of the median."
            ]
          },
          {
            "round": 3,
            "title": "Online Coding Test",
            "problems": 3,
            "body": [
              "Consider a directed graph of ‘N’ nodes where each node is labeled from ‘0’ to ‘N - 1’. Each edge of the graph is either ‘red’ or ‘blue’ colored. The graph may contain self-edges or parallel edges. You are given two arrays, ‘redEdges’ and ‘blueEdges’, whose each element is of the form [i, j], denoting an edge from node ‘i’ to node ‘j’ of the respective color. Your task is to compute an array ‘answer’ of size ‘N’, where ‘answer[i]’ stores the length of the shortest path from node ‘0’ to node ‘i’ such that the edges along the path have alternate colors. If there is no such path from node ‘0’ to ‘i’, then ‘answer[i] = -1’.",
              "You are given a list of strings, ‘DICTIONARY[]’ that represents the correct spelling of words and a query string ‘QUERY’ that may have incorrect spelling. You have to check whether the spelling of the string ‘QUERY’ is correct or not. If not, then return the list of suggestions from the list ‘DICTIONARY’. Otherwise, return an empty list which will be internally interpreted as the correct string.",
              "A city's skyline is the outer contour of the silhouette formed by all the buildings in that city when viewed from a distance. Given the locations and heights of all the buildings, return the skyline formed by these buildings collectively.\n\nThe geometric information of each building is given in the array buildings where buildings[i] = [left, right, height]:\n\nleft is the x coordinate of the left edge of the ith building.\nright is the x coordinate of the right edge of the ith building.\nheight is the height of the ith building.\nYou may assume all buildings are perfect rectangles grounded on an absolutely flat surface at height 0.\n\nThe skyline should be represented as a list of 'key points' sorted by their x-coordinate in the form [[x1,y1],[x2,y2],...]. Each key point is the left endpoint of some horizontal segment in the skyline except the last point in the list, which always has a y-coordinate 0 and is used to mark the skyline's termination where the rightmost building ends. Any ground between the leftmost and rightmost buildings should be part of the skyline's contour."
            ]
          },
          {
            "round": 4,
            "title": "HR Round",
            "problems": 3,
            "body": [
              "Introduction",
              "Why do you want to join us?",
              "Why are you suited for this role?"
            ]
          }
        ],
        "selected": true,
        "user": "anonymous",
        "date": "2025-04-20"
      },
      {
        "title": "System Engineer",
        "company": "infosys",
        "rounds": [
          {
            "round": 1,
            "title": "Online Coding Interview",
            "problems": 2,
            "body": [
              "An array was given and we had to sort the array in increasing order where some conditions were given.",
              "It was a question related to the prefix sum."
            ]
          },
          {
            "round": 2,
            "title": "On-site",
            "problems": 2,
            "body": [
              "The question was to find the first and last positions of an element in a sorted array.",
              "Questions revolving around Databases."
            ]
          },
          {
            "round": 4,
            "title": "HR Round",
            "problems": 2,
            "body": [
              "Introduction",
              "How do you manage problems in the project?"
            ]
          }
        ],
        "selected": false,
        "user": "anonymous",
        "date": "2025-04-20"
      },
      {
        "title": "Java Developer",
        "company": "cognizant",
        "rounds": [
          {
            "round": 1,
            "title": "Onsite",
            "problems": 3,
            "body": [
              "Can a constructor be inherited from a parent class to a child class?",
              "Create a Student class and a list of students. Write a program in Java 8 to filter all students with rollNo > 50, concatenate their first and last names, and return the result.",
              "You have been given an array ‘a’ of ‘n’ unique non-negative integers. Find the second largest and second smallest element from the array. Return the two elements (second largest and second smallest) as another array of size 2."
            ]
          },
          {
            "round": 2,
            "title": "Onsite",
            "problems": 6,
            "body": [
              "Create a CRUD application. How would you start? What classes would you create, and which annotations would be needed?",
              "Have you worked with AWS? How would you connect to S3? How would you deploy an app?",
              "Using the Stream API, write a program to find the department's maximum salary.",
              "How would you implement security? What is EnableWebSecurity?",
              "Are you familiar with design patterns?",
              "How can you connect a microservice? "
            ]
          }
        ],
        "selected": false,
        "user": "anonymous",
        "date": "2025-04-20"
      },
      {
        "title": "SDE Fresher",
        "company": "samsung",
        "rounds": [
          {
            "round": 1,
            "title": "Onsite",
            "problems": 4,
            "body": [
              "Of 6 look alike balls, 3 are heavy and the other three are light. How many weighings on a beam balance are necessary to identify the heavy balls?",
              "Write and explain merge sort",
              "What is an array and linked list. Pros , cons",
              "What are the different methods in an API request. What is the difference between POST and PUT"
            ]
          },
          {
            "round": 2,
            "title": "Technical Round",
            "problems": 5,
            "body": [
              "Count number of contiguous lesser elements to the left for each element in the given array.",
              "You are given an array of positive integers. Your task is to print a vertical line graph (bar chart style) that visually represents the values in the array using vertical bars |. Each bar corresponds to an element in the array, and the height of the bar is proportional to the value at that index. The highest bar will touch the topmost row, and shorter bars will align accordingly below it.",
              "What is a deadlock in operating system?",
              "Explain Indexing and Normalization in DBMS",
              "student(id,name,marks,dep_id), department(id,name) – Write query to print for each department,the name of the department along with the student name(s) who got first mark in that department"
            ]
          },
          {
            "round": 3,
            "title": "Technical Round 2",
            "problems": 3,
            "body": [
              "Reverse word by word in a string sentence without any predefined functions. Eg: this is a string, Output: siht si a gnirts",
              "You are given an integer n and a 2D array requirements, where requirements[i] = [endi, cnti] represents the end index and the inversion count of each requirement.\n\nA pair of indices (i, j) from an integer array nums is called an inversion if:\ni < j and nums[i] > nums[j]\nReturn the number of permutations perm of [0, 1, 2, ..., n - 1] such that for all requirements[i], perm[0..endi] has exactly cnti inversions.",
              "Print Vertical order traversal of Binary tree"
          ]
          }
        ],
        "selected": true,
        "user": "anonymous",
        "date": "2025-04-20"
      },
      {
        "title": "Associate System Engineer",
        "company": "ibm",
        "rounds": [
          {
            "round": 1,
            "title": "Coding Challenge",
            "problems": 2,
            "body": [
              "This question was about playing around with strings, which was of easy level",
              "Second problem involved dynamic programming and arrays, which means solving complex problems by breaking them down into simpler steps."
            ]
          },
          {
            "round": 2,
            "title": "English language assessment",
            "problems": 1,
            "body": [
              "The assessment covered various aspects of English proficiency, including vocabulary, spotting errors, spellings, synonyms, antonyms, and fill in the blanks. It required quick thinking and precision"
            ]
          },
          {
            "round": 3,
            "title": "Group Discussion",
            "problems": 1,
            "body": [
              "The topic given to us was Android versus iPhone. We had to work together to come up with solutions"
          ]
          },
          {
            "round": 4,
            "title": "HR",
            "problems": 1,
            "body": [
              "We had a discussion around my problem solving skills. If I have knowledge of AI and other HR questions."
          ]
          }
        ],
        "selected": true,
        "user": "anonymous",
        "date": "2025-04-20"
      },
      {
        "title": "SDE Fresher",
        "company": "accolite",
        "rounds": [
          {
            "round": 1,
            "title": "Coding Round",
            "problems": 3,
            "body": [
              "Given a 2D matrix mat with dimensions R×C. Find the maximum possible sum of any submatrix within the given matrix.",
              "Design a tic tac toe game algorithm with all corner cases",
              "Given an integer array coins[ ] representing different denominations of currency and an integer sum, find the number of ways you can make sum by using different combinations from coins[ ]."
            ]
          },
          {
            "round": 2,
            "title": "Coding Round",
            "problems": 2,
            "body": [
              "Given an array nums of n positive integers. The task is to find the longest Zig-Zag subsequence problem such that all elements of this are alternating (numsi-1 < numsi > numsi+1 or numsi-1 > numsi < numsi+1).",
              "Find the smallest substring which consists all the alphabets."
            ]
          },
          {
            "round": 3,
            "title": "HR Round",
            "problems": 3,
            "body": [
              "Introduce yourself",
              "How do I manage stress?",
              "What are my stengths and weaknesses"
          ]
          },
          {
            "round": 3,
            "title": "Final Round",
            "problems": 3,
            "body": [
              "Psuedo Code for Insertion and Deletion in BST",
              "How do I manage stress?",
              "What are my stengths and weaknesses"
          ]
          }
        ],
        "selected": true,
        "user": "anonymous",
        "date": "2025-04-20"
      },
      {
        "title": "Accenture Interview Experience",
        "company": "accenture",
        "rounds": [
          {
            "round": 1,
            "title": "Aptitude and Technical Test",
            "problems": 1,
            "body": [
              "There were aptitude and technicals questions. They were around 70-80 questions covering topics like verbal reasoning, cloud computing, computer networks, and general aptitude."
            ]
          },
          {
            "round": 2,
            "title": "Coding Round",
            "problems": 2,
            "body": [
              "Check if a given number is a prime number",
              "Given a string, return a new string formatted as the first character + length of the string + the last character."
            ]
          },
          {
            "round": 3,
            "title": "Screening",
            "problems": 3,
            "body": [
              "Brief introduction of my projects",
              "Involvement in extracurricular activities",
              "Hackathons that I had participated in"
          ]
          }
        ],
        "selected": false,
        "user": "anonymous",
        "date": "2025-04-20"
      }
  ]
  