[
    {
      "type": "h4",
      "text": "What is a Binary Tree?"
    },
    {
      "type": "p5",
      "text": "A Binary Tree is a specialized tree structure where each node can have a maximum of two children. These children are referred to as the left child and the right child. Unlike a general tree where a node can have any number of children, a Binary Tree restricts each node to only two children."
    },
    {
      "type": "h5",
      "text": "Properties of Binary Trees"
    },
    {
      "type": "ul",
      "text": [
        "All leaf nodes in a Binary Tree must be at the same level.",
        "Every node (except the root) must have at least [m/2]-1 keys and a maximum of m-1 keys.",
        "A non-leaf node with n-1 keys must have n children.",
        "The key values inside a node must be arranged in ascending order.",
        "All internal nodes must have at least m/2 children.",
        "If the root is a non-leaf node, it must have at least two children."
      ]
    },
    {
      "type": "h5",
      "text": "Binary Tree Representation"
    },
    {
      "type": "ul",
      "text": [
        "Array Representation: A Binary Tree can be represented using a 1-dimensional array where elements are arranged based on their positions.",
        "Linked List Representation: A Binary Tree can also be represented using linked nodes, where each node has links to its left and right children."
      ]
    },
    {
      "type": "h5",
      "text": "Types of Binary Trees"
    },
    {
      "type": "ul",
      "text": [
        "Strictly Binary Tree: A binary tree in which every node has either zero or exactly two children.",
        "Complete Binary Tree: A binary tree where every internal node has exactly two children, and all leaf nodes are at the same level.",
        "Extended Binary Tree: A full binary tree obtained by adding dummy nodes to a binary tree, making all nodes have two children.",
        "Threaded Binary Tree: A binary tree where all left child pointers that are NULL point to the in-order predecessor, and all right child pointers that are NULL point to the in-order successor."
      ]
    }
  ]
  