{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": "458",
            "title": "Poor Pigs",
            "titleSlug": "poor-pigs",
            "content": "<p>There are <code>buckets</code> buckets of liquid, where <strong>exactly one</strong> of the buckets is poisonous. To figure out which one is poisonous, you feed some number of (poor) pigs the liquid to see whether they will die or not. Unfortunately, you only have <code>minutesToTest</code> minutes to determine which bucket is poisonous.</p>\n\n<p>You can feed the pigs according to these steps:</p>\n\n<ol>\n\t<li>Choose some live pigs to feed.</li>\n\t<li>For each pig, choose which buckets to feed it. The pig will consume all the chosen buckets simultaneously and will take no time. Each pig can feed from any number of buckets, and each bucket can be fed from by any number of pigs.</li>\n\t<li>Wait for <code>minutesToDie</code> minutes. You may <strong>not</strong> feed any other pigs during this time.</li>\n\t<li>After <code>minutesToDie</code> minutes have passed, any pigs that have been fed the poisonous bucket will die, and all others will survive.</li>\n\t<li>Repeat this process until you run out of time.</li>\n</ol>\n\n<p>Given <code>buckets</code>, <code>minutesToDie</code>, and <code>minutesToTest</code>, return <em>the <strong>minimum</strong> number of pigs needed to figure out which bucket is poisonous within the allotted time</em>.</p>\n\n<p>&nbsp;</p>\n<p><strong class=\"example\">Example 1:</strong></p>\n\n<pre>\n<strong>Input:</strong> buckets = 4, minutesToDie = 15, minutesToTest = 15\n<strong>Output:</strong> 2\n<strong>Explanation:</strong> We can determine the poisonous bucket as follows:\nAt time 0, feed the first pig buckets 1 and 2, and feed the second pig buckets 2 and 3.\nAt time 15, there are 4 possible outcomes:\n- If only the first pig dies, then bucket 1 must be poisonous.\n- If only the second pig dies, then bucket 3 must be poisonous.\n- If both pigs die, then bucket 2 must be poisonous.\n- If neither pig dies, then bucket 4 must be poisonous.\n</pre>\n\n<p><strong class=\"example\">Example 2:</strong></p>\n\n<pre>\n<strong>Input:</strong> buckets = 4, minutesToDie = 15, minutesToTest = 30\n<strong>Output:</strong> 2\n<strong>Explanation:</strong> We can determine the poisonous bucket as follows:\nAt time 0, feed the first pig bucket 1, and feed the second pig bucket 2.\nAt time 15, there are 2 possible outcomes:\n- If either pig dies, then the poisonous bucket is the one it was fed.\n- If neither pig dies, then feed the first pig bucket 3, and feed the second pig bucket 4.\nAt time 30, one of the two pigs must die, and the poisonous bucket is the one it was fed.\n</pre>\n\n<p>&nbsp;</p>\n<p><strong>Constraints:</strong></p>\n\n<ul>\n\t<li><code>1 &lt;= buckets &lt;= 1000</code></li>\n\t<li><code>1 &lt;=&nbsp;minutesToDie &lt;=&nbsp;minutesToTest &lt;= 100</code></li>\n</ul>\n",
            "isPaidOnly": false,
            "difficulty": "Hard",
            "likes": 1746,
            "dislikes": 3337,
            "similarQuestions": "[]",
            "topicTags": [
                {
                    "name": "Math",
                    "slug": "math"
                },
                {
                    "name": "Dynamic Programming",
                    "slug": "dynamic-programming"
                },
                {
                    "name": "Combinatorics",
                    "slug": "combinatorics"
                }
            ],
            "stats": "{\"totalAccepted\": \"116.5K\", \"totalSubmission\": \"193.9K\", \"totalAcceptedRaw\": 116546, \"totalSubmissionRaw\": 193859, \"acRate\": \"60.1%\"}",
            "hints": [
                "What if you only have one shot? Eg. 4 buckets, 15 mins to die, and 15 mins to test.",
                "How many states can we generate with x pigs and T tests?",
                "Find minimum <code>x</code> such that <code>(T+1)^x >= N</code>"
            ],
            "rephrased": {
                "body": "You have `buckets` number of liquid buckets, with exactly one containing poison. To identify the poisonous bucket, you'll feed pigs the liquid and observe if they die. You have `minutesToTest` minutes to determine the poisonous bucket.\n\nPigs are fed according to these steps:\n\n1.  Select live pigs for feeding.\n2.  Assign each pig a set of buckets to consume simultaneously. Pigs can drink from any number of buckets, and buckets can be consumed by multiple pigs.\n3.  Wait `minutesToDie` minutes. No additional feeding is allowed during this time.\n4.  After `minutesToDie` minutes, pigs that consumed the poisonous bucket will die, while others survive.\n5.  Repeat the process until time runs out.\n\nGiven `buckets`, `minutesToDie`, and `minutesToTest`, determine the minimum number of pigs needed to guarantee identification of the poisonous bucket within the given time.",
                "constraints": [
                    "1 <= buckets <= 1000",
                    "1 <= minutesToDie <= minutesToTest <= 100"
                ],
                "testcases": [
                    {
                        "input": "buckets = 4, minutesToDie = 15, minutesToTest = 15",
                        "output": "2",
                        "explanation": "With 2 pigs, we can test at time 0. Pig 1 drinks from buckets 1 and 2, and Pig 2 drinks from buckets 2 and 3. If only Pig 1 dies, bucket 1 is poisonous. If only Pig 2 dies, bucket 3 is poisonous. If both die, bucket 2 is poisonous. If neither die, bucket 4 is poisonous."
                    },
                    {
                        "input": "buckets = 4, minutesToDie = 15, minutesToTest = 30",
                        "output": "2",
                        "explanation": "With 2 pigs, we can test at time 0. Pig 1 drinks from bucket 1, and Pig 2 drinks from bucket 2. If either pig dies, the bucket it drank from is poisonous. If neither die, then at time 15, feed Pig 1 bucket 3, and Pig 2 bucket 4. At time 30, one pig will die, indicating the poisonous bucket."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "What if you only have one shot? Eg. 4 buckets, 15 mins to die, and 15 mins to test.",
            "How many states can we generate with x pigs and T tests?",
            "Find minimum <code>x</code> such that <code>(T+1)^x >= N</code>"
        ],
        "relatedTopics": [
            {
                "name": "Math",
                "slug": "math"
            },
            {
                "name": "Dynamic Programming",
                "slug": "dynamic-programming"
            },
            {
                "name": "Combinatorics",
                "slug": "combinatorics"
            }
        ]
    }
}