{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 15649,
            "title": "Axel and Shawn’s Football game",
            "titleSlug": "axel-and-shawn-s-football-game_2663295",
            "content": "<h4 id=\"axel-and-shawn-just-finished-their-football-practice-and-are-now-tired-so-they-can-t-go-back-and-play-football-but-they-have-come-up-with-a-new-game-to-make-the-best-out-of-their-time\">Axel and Shawn just finished their football practice and are now tired, so they can’t go back and play football, but they have come up with a new game to make the best out of their time.</h4>\n\n<h4 id=\"there-are-two-rooms-one-of-the-rooms-has-n-baskets-and-the-other-has-m-baskets-each-basket-is-large-enough-to-hold-multiple-footballs-in-each-turn-a-player-has-to-select-a-basket-from-their-respective-room-and-pick-up-some-positive-number-of-football-s-the-player-loses-if-he-is-not-able-to-pick-up-any-football\">There are two rooms, one of the rooms has ‘N’ baskets and the other has ‘M’ baskets, each basket is large enough to hold multiple footballs. In each turn, a player has to select a basket from their respective room and pick up some <bold>positive</bold> number of football(s), the player loses if he is not able to pick up any football.</h4>\n\n<h4 id=\"in-each-round-axel-plays-the-first-turn-and-shawn-plays-the-second-one-both-axel-and-shawn-should-be-in-different-rooms-when-the-round-starts-before-the-start-of-each-round-you-can-decide-the-room-each-player-is-assigned-axel-is-your-close-friend-and-you-will-try-your-best-to-make-axel-win-the-game-predict-the-winner-if-both-the-players-play-optimally-and-you-try-your-best-to-make-axel-win-the-game\">In each round Axel plays the first turn and Shawn plays the second one. Both Axel and Shawn should be in different rooms when the round starts. Before the start of each round, you can decide the room each player is assigned. Axel is your close friend and you will try your best to make Axel win the game. Predict the winner if both the players play optimally and you try your best to make Axel win the game.</h4>\n\n<h5 id=\"for-example\">For Example :</h5>\n\n<pre><code>If room1: {1, 2, 3} and room2: {1, 1}\n\nThen, Axel will be assigned room1 at the beginning of each round, and both Shawn and Axel will pick only one football in each round as they play optimally, this will result in Shawn exhausting the remaining balls in room2 early, and ultimately losing the game.\n</code></pre>\n\n<h5 id=\"input-format\">Input Format :</h5>\n\n<pre><code>The first line contains a single integer ‘T’ denoting the number of test cases, then each test case follows:\n\nThe first line of each test case contains two integers ‘N’ and ‘M’ denoting the number of baskets in each of the rooms respectively.\n\nThe next two lines of each test case contain the information about the balls in each basket, the first line contains ‘N’ integers denoting the balls in each basket of room-1 and the next line contains ‘M’ integers denoting the balls in each basket present in room-2.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format :</h5>\n\n<pre><code>For each test case, print the name of the winner, print “Axel” if it’s possible for Axel to win the game, else print “Shawn”.\n\nOutput for each test case will be printed in a separate line.\n</code></pre>\n\n<h5 id=\"note\">Note :</h5>\n\n<pre><code>You are not required to print anything; it has already been taken care of. Just implement the function.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints :</h5>\n\n<pre><code>1 ≤ T ≤ 10      \n1 ≤ N, M ≤ 10000\n0 ≤ Room1[i], Room2[i] ≤ 10^9\n\nTime limit: 1 sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1 :</h5>\n\n<pre><code>2\n3 2\n1 2 3\n1 1\n1 1\n5\n7\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1 :</h5>\n\n<pre><code>Axel\nAxel\n</code></pre>\n\n<h5 id=\"explanation-for-sample-input-1\">Explanation For Sample Input 1 :</h5>\n\n<pre><code>For test case 1 :\nAxel will win because:\nHe will be assigned room1 at the beginning of each round, and both Shawn and Axel will pick only one football in each round as they play optimally, this will result in Shawn exhausting the remaining balls first, and ultimately losing.\n\nFor test case 2 : \nAxel will win because:\nAxel will be assigned to room-1 as it has more footballs, and in each round both the players will pick one football, Axel will ultimately win the game.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2 :</h5>\n\n<pre><code>2\n1 1\n5\n5\n4 3\n4 0 2 1\n3 1 0 \n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2 :</h5>\n\n<pre><code>Shawn\nAxel\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Medium",
            "likes": 8,
            "dislikes": "NA",
            "rephrased": {
                "body": "Axel and Shawn are tired after football practice and decide to play a new game. There are two rooms, one with N baskets and the other with M baskets. Each basket can hold many footballs. In each turn, a player picks a positive number of footballs from a basket in their assigned room. A player loses if they cannot pick any footballs.\n\nAxel plays first in each round, and Shawn plays second. They must be in different rooms at the start of each round. You get to decide which room each player is assigned to before each round. Your goal is to help Axel win. Predict the winner assuming both players play optimally.",
                "constraints": [
                    "1 ≤ T ≤ 10",
                    "1 ≤ N, M ≤ 10000",
                    "0 ≤ Room1[i], Room2[i] ≤ 10^9",
                    "Time limit: 1 sec"
                ],
                "testcases": [
                    {
                        "input": "2\n3 2\n1 2 3\n1 1\n1 1\n5\n7",
                        "output": "Axel\nAxel",
                        "explanation": "Test Case 1: Axel is assigned to room 1, where he picks one football in each round. Shawn is assigned to room 2 and also picks one football in each round.  Shawn runs out of footballs first, so Axel wins.\n\nTest Case 2: Axel is assigned to room 1 as it has more footballs, and in each round both the players will pick one football, Axel will ultimately win the game."
                    },
                    {
                        "input": "2\n1 1\n5\n5\n4 3\n4 0 2 1\n3 1 0",
                        "output": "Shawn\nAxel",
                        "explanation": "Test Case 1: Regardless of room assignment, the total number of balls is the same. Each player can remove any amount of footballs from a room in their turns. If axel is in the first room, he takes all 5 balls. Now, shawn is assigned the second room where there are 5 balls. so shawn can remove all 5 balls. Since Axel starts, he loses if both plays optimally.\n\nTest Case 2: Axel can be assigned to the room with 4 baskets (4 0 2 1), giving him a larger pool of initial footballs.  If both take one football from a basket each turn, Axel will exhaust the room with 3 baskets first, and he will still have access to other footballs to pick."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Axel will win the game if is placed in the room with more footballs at the beginning of each round, as both Axel and Shawn will remove only one football in each round. Try to find the conditions where Shawn will win!</p>"
        ],
        "relatedTopics": [
            {
                "name": "Sorting",
                "slug": "sorting"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}