{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 10132,
            "title": "Check if Possible to survive",
            "titleSlug": "check-if-possible-to-survive_1170052",
            "content": "<h4 id=\"you-are-a-poor-citizen-of-an-island-that-has-only-one-shop-for-groceries-which-is-open-six-days-a-week-and-is-closed-on-sundays-the-first-day-of-the-week-is-monday-you-can-buy-n-units-of-food-from-a-day-s-work-now-each-day-you-need-x-units-of-food-to-survive-you-are-making-a-boat-to-escape-the-island-which-will-require-d-days-to-be-made-you-need-to-survive-at-least-d-days-on-the-island-you-are-given-three-integers-n-x-and-d-your-task-is-to-determine-if-you-can-escape-the-island\">You are a poor citizen of an island that has only one shop for groceries, which is open six days a week and is closed on Sundays. The first day of the week is Monday. You can buy ‘n’ units of food from a day’s work. Now each day, you need ‘x’ units of food to survive. You are making a boat to escape the island, which will require ‘d’ days to be made. You need to survive at least ‘d’ days on the island. You are given three integers n, x, and d. Your task is to determine if you can escape the island</h4>\n\n<h5 id=\"input-format\">Input Format:</h5>\n\n<pre><code>The first line of input contains an integer ‘T’ denoting the number of test cases to run. Then the test cases follow.\n\nThe first and the only line of each test case contains three space-separated integers n, x, and d.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format</h5>\n\n<pre><code>For each test case, print YES if it is possible to survive on the island; else, print NO.\n\nOutput for each test case will be printed in a separate line.\n</code></pre>\n\n<h5 id=\"note\">Note:</h5>\n\n<pre><code>You do not need to print anything; it has already been taken care of. Just implement the given function.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints:</h5>\n\n<pre><code>1 &lt;= T &lt;= 10^4\n1&lt;= n, m, d&lt;=10^8\n\nWhere ‘T’ is the total number of test cases and n denotes the units of food the citizen can buy from one day salary, x denotes the units needed to survive each day and d denotes the minimum number of days the citizen needs to survive on the island to escape it.   \n\nTime limit: 1 sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1:</h5>\n\n<pre><code>2\n16 2 10\n2 4 20\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1:</h5>\n\n<pre><code>YES\nNO\n</code></pre>\n\n<h5 id=\"explanation-of-sample-input-1\">Explanation of sample input 1 :</h5>\n\n<pre><code>Test Case 1:\n\nOne possible solution is to buy food on the first day (Monday). It’s sufficient to eat from this food up to the 8th day (Monday) inclusive. On the 9th day (Tuesday), repurchase food and use the food to survive the 9th and 10th day.\n\nTest Case 2:\n\nWe can not survive as we make only two units of food per day, but we consume four units of food, so we will not be able to survive.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2:</h5>\n\n<pre><code>2\n10 2 30\n10 9 5\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2:</h5>\n\n<pre><code>YES\nYES\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Easy",
            "likes": 1,
            "dislikes": "NA",
            "rephrased": {
                "body": "A person is stranded on an island with a single grocery shop open six days a week (closed on Sundays, Monday being the first day). They can acquire 'n' units of food per workday and need 'x' units daily to survive. To escape, they must build a boat requiring 'd' days and survive for at least 'd' days on the island. Given n, x, and d, determine if survival is possible.",
                "constraints": [
                    "1 <= T <= 10^4",
                    "1 <= n, x, d <= 10^8",
                    "T is the number of test cases.",
                    "n is the units of food acquired per workday.",
                    "x is the units of food needed for daily survival.",
                    "d is the minimum number of survival days needed."
                ],
                "testcases": [
                    {
                        "input": "16 2 10",
                        "output": "YES",
                        "explanation": "The person can work and gather food to survive for at least 10 days. In this scenario, the person gains enough food to surpass their daily needs."
                    },
                    {
                        "input": "2 4 20",
                        "output": "NO",
                        "explanation": "The person consumes more food daily (4 units) than they can acquire through work (2 units), rendering long-term survival impossible."
                    },
                    {
                        "input": "10 2 30",
                        "output": "YES",
                        "explanation": "The person can work and gather food to survive for at least 30 days. The daily food intake is less than the food the citizen makes each day."
                    },
                    {
                        "input": "10 9 5",
                        "output": "YES",
                        "explanation": "The person can work and gather food to survive for at least 5 days. The daily food intake is less than the food the citizen makes each day, and therefore can survive for the minimum number of days."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Can we get some condition for a person to survive?</p>"
        ],
        "relatedTopics": [
            {
                "name": "Greedy",
                "slug": "greedy"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}