{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 10132,
            "title": "Check if Possible to survive",
            "titleSlug": "check-if-possible-to-survive_1170052",
            "content": "<h4 id=\"you-are-a-poor-citizen-of-an-island-that-has-only-one-shop-for-groceries-which-is-open-six-days-a-week-and-is-closed-on-sundays-the-first-day-of-the-week-is-monday-you-can-buy-n-units-of-food-from-a-day-s-work-now-each-day-you-need-x-units-of-food-to-survive-you-are-making-a-boat-to-escape-the-island-which-will-require-d-days-to-be-made-you-need-to-survive-at-least-d-days-on-the-island-you-are-given-three-integers-n-x-and-d-your-task-is-to-determine-if-you-can-escape-the-island\">You are a poor citizen of an island that has only one shop for groceries, which is open six days a week and is closed on Sundays. The first day of the week is Monday. You can buy ‘n’ units of food from a day’s work. Now each day, you need ‘x’ units of food to survive. You are making a boat to escape the island, which will require ‘d’ days to be made. You need to survive at least ‘d’ days on the island. You are given three integers n, x, and d. Your task is to determine if you can escape the island</h4>\n\n<h5 id=\"input-format\">Input Format:</h5>\n\n<pre><code>The first line of input contains an integer ‘T’ denoting the number of test cases to run. Then the test cases follow.\n\nThe first and the only line of each test case contains three space-separated integers n, x, and d.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format</h5>\n\n<pre><code>For each test case, print YES if it is possible to survive on the island; else, print NO.\n\nOutput for each test case will be printed in a separate line.\n</code></pre>\n\n<h5 id=\"note\">Note:</h5>\n\n<pre><code>You do not need to print anything; it has already been taken care of. Just implement the given function.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints:</h5>\n\n<pre><code>1 &lt;= T &lt;= 10^4\n1&lt;= n, m, d&lt;=10^8\n\nWhere ‘T’ is the total number of test cases and n denotes the units of food the citizen can buy from one day salary, x denotes the units needed to survive each day and d denotes the minimum number of days the citizen needs to survive on the island to escape it.   \n\nTime limit: 1 sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1:</h5>\n\n<pre><code>2\n16 2 10\n2 4 20\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1:</h5>\n\n<pre><code>YES\nNO\n</code></pre>\n\n<h5 id=\"explanation-of-sample-input-1\">Explanation of sample input 1 :</h5>\n\n<pre><code>Test Case 1:\n\nOne possible solution is to buy food on the first day (Monday). It’s sufficient to eat from this food up to the 8th day (Monday) inclusive. On the 9th day (Tuesday), repurchase food and use the food to survive the 9th and 10th day.\n\nTest Case 2:\n\nWe can not survive as we make only two units of food per day, but we consume four units of food, so we will not be able to survive.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2:</h5>\n\n<pre><code>2\n10 2 30\n10 9 5\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2:</h5>\n\n<pre><code>YES\nYES\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Easy",
            "likes": 1,
            "dislikes": "NA",
            "rephrased": {
                "body": "You are stranded on an island with a single grocery shop open six days a week (closed on Sundays). You can acquire 'n' units of food each day you work. To survive, you need 'x' units of food daily. You plan to build a boat to escape, which will take 'd' days. Determine if you can survive for at least 'd' days on the island with your food gathering capabilities.",
                "constraints": [
                    "1 <= T <= 10^4",
                    "1 <= n, x, d <= 10^8",
                    "T is the total number of test cases, n is the units of food acquired per day, x is the units needed to survive each day, and d is the minimum number of days needed to survive."
                ],
                "testcases": [
                    {
                        "input": "n = 16, x = 2, d = 10",
                        "output": "YES",
                        "explanation": "Buying food on Monday yields 16 units. This is enough to survive for 8 days (16/2 = 8). Buying food again on the 9th day (Tuesday) ensures survival for the remaining 2 days."
                    },
                    {
                        "input": "n = 2, x = 4, d = 20",
                        "output": "NO",
                        "explanation": "You consume 4 units of food daily but can only acquire 2 units per day. Thus, survival is impossible."
                    },
                    {
                        "input": "n = 10, x = 2, d = 30",
                        "output": "YES",
                        "explanation": "You can obtain 10 units of food a day and require 2 units a day, so for any given day, you have 10/2 = 5 days worth of food. Since you only need to survive 30 days, this is possible."
                    },
                    {
                        "input": "n = 10, x = 9, d = 5",
                        "output": "YES",
                        "explanation": "You can obtain 10 units of food a day and require 9 units a day, so for any given day, you have 10/9 > 1 days worth of food. Since you only need to survive 5 days, this is possible."
                    },
                    {
                        "input": "n = 5, x = 5, d = 7",
                        "output": "NO",
                        "explanation": "With n = 5 and x = 5, you can survive for one day for each day you work. Since the shop is closed on Sunday, you can only work 6 out of 7 days. Therefore, it is not possible to survive for d = 7 days. Notice, that if d <= 6, then it would be possible to survive"
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Can we get some condition for a person to survive?</p>"
        ],
        "relatedTopics": [
            {
                "name": "Greedy",
                "slug": "greedy"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}