{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 9095,
            "title": "Chocolate Bar",
            "titleSlug": "chocolate-bar_975353",
            "content": "<h4 id=\"you-are-given-a-chocolate-bar-in-the-form-of-a-grid-consisting-of-n-x-m-pieces-of-chocolate-your-task-is-to-take-out-exactly-k-pieces-of-chocolate-by-cutting-the-chocolate-bar-either-horizontally-or-vertically-this-operation-will-cost-you-the-square-of-break-length\">You are given a chocolate bar in the form of a grid consisting of N x M pieces of chocolate. Your task is to take out exactly ‘K’ pieces of chocolate by cutting the chocolate bar either horizontally or vertically. This operation will cost you the square of break length.</h4>\n\n<h4 id=\"for-example-if-you-have-a-chocolate-bar-of-size-3x4-then-you-can-cut-horizontally-and-get-two-bars-of-the-chocolate-of-size-1x4-and-2x4-the-cost-of-this-cut-will-be-4-2-16-or-you-can-cut-vertically-and-get-two-bars-of-the-chocolate-of-size-3x1-and-3x3-the-cost-of-this-cut-will-be-3-2-9\">For example: If you have a chocolate bar of size 3x4, then you can cut horizontally and get two bars of the chocolate of size 1x4 and 2x4. The cost of this cut will be 4^2  = 16 or you can cut vertically and get two bars of the chocolate of size 3x1 and 3x3. The cost of this cut will be 3^2 = 9.</h4>\n\n<h4 id=\"you-are-given-q-queries-and-for-each-query-you-need-to-find-the-minimum-cost-such-that-after-all-the-cutting-operations-exactly-k-pieces-are-obtained-from-a-chocolate-of-dimension-n-x-m\">You are given ‘Q’ queries and for each query you need to find the minimum cost such that after all the cutting operations, exactly ‘K’ pieces are obtained from a chocolate of dimension N x M.</h4>\n\n<h4 id=\"note\">Note:</h4>\n\n<pre><code>1.You can discard the remaining N x M - K pieces.\n2.You do not need to print anything. It has already been taken care of by our driver code. Just implement the given function and return the minimum cost of cutting the chocolate bar to get exactly ‘K’ pieces of chocolate for each query.\n</code></pre>\n\n<h5 id=\"input-format\">Input Format:</h5>\n\n<pre><code>The first line of the input contains an integer ‘Q’ denoting the number of queries.\n\nThe first line of each query contains three space-separated integer values ‘N’, ‘M’, ‘K’ denoting the dimensions of the chocolate bar and the number of pieces you want, respectively.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format:</h5>\n\n<pre><code>You need to print ‘Q’ lines, each line contains the output of each query which is an integer denoting the minimum total cost needed to break the chocolate bar, to make it possible to have K pieces of chocolate. \n</code></pre>\n\n<h5 id=\"constraints\">Constraints:</h5>\n\n<pre><code>1 &lt;= Q &lt;= 10^4\n1 &lt;= N,M &lt;= 30    \n1&lt;= K &lt;= min(NxM,50)\n\nTime Limit: 1 sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1:</h5>\n\n<pre><code> 2\n 2 2 1\n 2 2 4\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1:</h5>\n\n<pre><code> 5\n 0\n</code></pre>\n\n<h5 id=\"explanation-for-sample-input-1\">Explanation for sample input 1:</h5>\n\n<p><img src=\"https://files.codingninjas.in/chocolate-bar-2-6509.png\" alt=\"alt text\"></p>\n\n<pre><code>In the first query, we have a chocolate bar of size 2x2, and we want to take out exactly one chocolate piece. One of the possible ways of doing this is to cut horizontally, which will divide our bar into 2 bars of size 1x2 each. The side length is two due to which we have to add 4 ( 2^2 = 4) to our cost, then we discard one bar and further make a vertical cut on another bar. This time the side length we cut is 1, so our cost will become 5 ( 4 + 1 = 5). Finally, we have 2 bars of 1-1 pieces each; we keep one piece and discard the other.\n\nIn the second query, we have a chocolate bar of size 2x2, and we want to take out exactly four chocolate pieces. As this whole bar contains exactly four pieces of chocolate, hence we don’t have to make any cuts, and the cost will remain 0.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2:</h5>\n\n<pre><code>2\n3 4 5\n6 4 9\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2:</h5>\n\n<pre><code>14\n25\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Hard",
            "likes": 5,
            "dislikes": "NA",
            "rephrased": {
                "body": "You are given a chocolate bar represented as an N x M grid of pieces. Your goal is to determine the minimum cost to cut the chocolate bar horizontally or vertically to obtain exactly K pieces. Each cut incurs a cost equal to the square of the cut's length (the dimension being cut). You can discard excess pieces after cutting. Solve Q such queries.",
                "constraints": [
                    "1 <= Q <= 10^4",
                    "1 <= N, M <= 30",
                    "1 <= K <= min(N x M, 50)",
                    "Time Limit: 1 sec"
                ],
                "testcases": [
                    {
                        "input": "2\n2 2 1\n2 2 4",
                        "output": "5\n0",
                        "explanation": "Query 1: With a 2x2 bar, extracting 1 piece optimally involves a horizontal cut (cost 2^2 = 4) and then a vertical cut on one of the resulting 1x2 bars (cost 1^2 = 1), totaling a cost of 5. Discard the extra piece.\nQuery 2: With a 2x2 bar, needing 4 pieces means no cuts are required as the bar itself contains 4 pieces, resulting in a cost of 0."
                    },
                    {
                        "input": "2\n3 4 5\n6 4 9",
                        "output": "14\n25",
                        "explanation": "Query 1:  For a 3x4 bar wanting 5 pieces, one optimal solution involves a vertical cut giving cost 3^2=9 and a horizontal cut on one section to remove 1 piece i.e. cutting the 3x1 section, giving 1^2=1 cost. For the remaining 3x3 piece you will still need one more piece, hence cutting the 3x3 piece horizontally so that the final number of pieces = 5 and a cutting cost of 3^2=9 and 1^2=1 respectively gives a total cost = 14\nQuery 2: For a 6x4 bar wanting 9 pieces, one optimal solution involves making a horizontal cut to form bars of size 2x4 and 4x4 which results in 4^2 = 16 and cutting 4x4 into two of 2x4 each results into another 16 total 32 but that leaves the pieces into 8+8=16 which is not what we want (9 pieces). If we cut horizontally to form bars of sizes 3x4 and 3x4 results in pieces equal to 12+12=24 which leaves us far from what we want, hence we need to form bars of 4x4 and 2x4, forming 16 by cutting the 6x4 with cost = 16 where we need to form two bars of sizes 4x4 and 2x4 (16 pieces + 8 pieces), hence we just need to make one more cut and it will come out as 4^2+3^2 = 16+9 giving 25."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Try out all the possible ways to cut the chocolate bar horizontally or vertically.</p>",
            "<p>Try to memoize the above recursive approach.</p>",
            "<p>Try solving iteratively.</p>"
        ],
        "relatedTopics": [
            {
                "name": "Dynamic Programming",
                "slug": "dynamic-programming"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}