{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 15733,
            "title": "Conquer the Best Kingdom",
            "titleSlug": "conquer-the-best-kingdom_2689306",
            "content": "<h4 id=\"aragorn-is-a-great-ruler-and-desires-to-become-the-most-powerful-in-the-entire-world-there-are-n-kingdoms-kingdoms-are-numbered-from-0-to-n-1-and-form-of-a-tree-you-are-also-given-the-information-about-the-edges-of-this-tree-depicting-all-the-kingdoms-that-are-adjacent-to-each-other\">Aragorn is a great ruler and desires to become the most powerful in the entire world. There are ‘N’ kingdoms, kingdoms are numbered from 0 to &#39;N&#39; - 1 and form of a <strong>tree</strong>, you are also given the information about the edges of this tree depicting all the Kingdoms that are adjacent to each other.</h4>\n\n<h4 id=\"the-ruler-with-the-most-kingdoms-is-considered-the-most-powerful-you-desire-to-become-the-greatest-ruler-without-having-to-fight-with-aragorn-kingdoms-are-conquered-one-at-a-time-in-turns-in-order-to-make-the-process-smooth-and-less-violent\">The ruler with the most kingdoms is considered the most powerful. You desire to become the greatest ruler without having to fight with Aragorn. Kingdoms are conquered one at a time in turns in order to make the process smooth and less violent.</h4>\n\n<h4 id=\"aragorn-initially-rules-only-the-xth-kingdom-and-all-other-kingdoms-are-not-ruled-by-anyone-in-each-turn-a-ruler-can-conquer-another-kingdom-that-is-adjacent-to-one-of-his-current-kingdoms-and-is-ruled-by-none-of-the-rulers-the-opponent-plays-the-next-turn-and-the-process-is-repeated-the-game-continues-until-both-the-players-run-out-of-moves-if-a-ruler-has-no-available-adjacent-kingdom-to-conquer-then-he-passes-his-turn-in-the-end-the-ruler-with-more-kingdoms-under-his-control-wins-the-game\">Aragorn initially rules only the ‘X<sup>th</sup>’ kingdom and all other kingdoms are not ruled by anyone. In each turn, a ruler can conquer another kingdom that is adjacent to one of his current kingdoms and is ruled by none of the rulers, the opponent plays the next turn and the process is repeated. The game continues until both the players run out of moves. If a ruler has no available adjacent kingdom to conquer then he passes his turn. In the end, the ruler with more kingdoms under his control wins the game.</h4>\n\n<h4 id=\"aragorn-gives-you-an-advantage-in-the-first-turn-letting-you-choose-a-kingdom-of-your-choice-but-for-all-other-moves-you-can-only-conquer-a-kingdom-adjacent-to-one-of-your-current-kingdoms-if-aragorn-plays-optimally-determine-if-it-s-possible-for-you-to-win-by-becoming-the-most-powerful-or-not-print-true-if-you-can-become-more-powerful-than-aragorn-else-return-false\">Aragorn gives you an advantage in the first turn, letting you choose a kingdom of your choice, but for all other moves, you can only conquer a kingdom adjacent to one of your current kingdoms. If Aragorn plays optimally, determine if it’s possible for you to win by becoming the most powerful or not, print “true” if you can become more powerful than Aragorn, else return “false”.</h4>\n\n<h5 id=\"for-example\">For Example :</h5>\n\n<pre><code>If N = 7, X = 2 and Edges = { {0, 1}, {0, 2}, {1, 4}, {1, 5}, {2, 3}, {4, 6} }\n\nThen the tree is: \n</code></pre>\n\n<p><img src=\"https://files.codingninjas.in/1589735154342-13515.jpg\" alt=\"\"></p>\n\n<pre><code>Here N = 7 depicts that there are seven kingdoms (numbered from 0 to 6). Edges depict that kingdom-0 and kingdom-1 are adjacent, kingdom-0 and kingdom-2 are adjacent, and so on. And Aragorn initially controls kingdom-2.\nThen in this case, if you select kingdom-1 in your first then, then Aargon will select kingdom-0 in the next turn, as both rulers play optimally, therefore in the end Aargon will be ruling kingdom-0, kingdom-2 and kingdom-3 and the remaining four kingdoms will be ruled by you. Hence you will be able to win the game and therefore we will print “true”.\n</code></pre>\n\n<h5 id=\"input-format\">Input Format :</h5>\n\n<pre><code>The first line contains a single integer ‘T’ denoting the number of test cases, then each test case follows:\n\nThe first line of each test case contains three integers ‘N’, and ‘X’ denoting the number of kingdoms and the kingdom initially ruled by Aragorn respectively.\n\nThe next N - 1 lines each contain two integers each denoting the kingdoms that are adjacent to each other.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format :</h5>\n\n<pre><code>For each test case, print “true” if you can conquer more kingdoms than Aragorn, else print “false”.\n\nOutput for each test case will be printed in a separate line.\n</code></pre>\n\n<h5 id=\"note\">Note :</h5>\n\n<pre><code>You are not required to print anything; it has already been taken care of. Just implement the function.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints :</h5>\n\n<pre><code>1 ≤ T ≤ 10      \n2 ≤ N ≤ 1000\n0 ≤ X &lt; N\n0 ≤ Edges[i][0], Edges[i][1] &lt; N\n\nTime limit: 1 sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1 :</h5>\n\n<pre><code>2\n7 2\n0 1\n0 2\n1 4\n1 5\n2 3\n4 6\n2 0\n0 1\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1 :</h5>\n\n<pre><code>true\nfalse\n</code></pre>\n\n<h5 id=\"explanation-for-sample-input-1\">Explanation For Sample Input 1 :</h5>\n\n<pre><code>For test case 1 :\nWe will print “true” because:\nYou can conquer kingdom-1 in your first turn, this will finally result in Aragorn controlling kingdom-0, kingdom-2 and kingdom-3 and all other kingdoms will be controlled by you.\n\nFor test case 2 : \nWe will print “false” because:\nAragorn initially controls kingdom-0, as there are only two kingdoms so you will conquer kingdom-1 in your turn, the game will end after this. In the end, you don’t have more kingdoms than Aragorn, therefore you can’t become more powerful than Aragorn.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2 :</h5>\n\n<pre><code>2\n4 0\n0 1\n0 2\n0 3\n7 0\n0 1\n0 2\n0 3\n3 4\n4 5\n5 6\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2 :</h5>\n\n<pre><code>false\ntrue\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Medium",
            "likes": -7,
            "dislikes": "NA",
            "rephrased": {
                "body": "Aragorn, a powerful ruler, aims to dominate the world, which consists of 'N' kingdoms arranged in a tree structure, numbered from 0 to 'N' - 1.  The connections between kingdoms (edges) are given, indicating adjacency.  The goal is to surpass Aragorn in power (number of kingdoms ruled) without direct conflict.\n\nThe game proceeds in turns. Initially, Aragorn controls kingdom 'X'. In each turn, a ruler conquers an unclaimed kingdom adjacent to one of their existing kingdoms. If a ruler has no available moves, they pass. The game ends when neither ruler can make a move. The ruler with more kingdoms at the end wins.\n\nYou have the first pick of kingdom.  Assuming Aragorn plays optimally, determine if you can win the game (control more kingdoms than Aragorn).",
                "constraints": [
                    "1 ≤ T ≤ 10",
                    "2 ≤ N ≤ 1000",
                    "0 ≤ X < N",
                    "0 ≤ Edges[i][0], Edges[i][1] < N",
                    "Time limit: 1 sec"
                ],
                "testcases": [
                    {
                        "input": "7 2\n0 1\n0 2\n1 4\n1 5\n2 3\n4 6",
                        "output": "true",
                        "explanation": "Selecting kingdom 1 initially allows you to eventually control kingdoms 1, 4, 5, and 6.  Aragorn will control 0, 2, and 3. You win with 4 kingdoms to Aragorn's 3."
                    },
                    {
                        "input": "2 0\n0 1",
                        "output": "false",
                        "explanation": "Aragorn starts with kingdom 0. You must take kingdom 1 in the first turn. The game ends.  Aragorn has 1 kingdom and you have 1. You don't have more kingdoms than Aragorn."
                    },
                    {
                        "input": "4 0\n0 1\n0 2\n0 3",
                        "output": "false",
                        "explanation": "Aragorn starts with 0.  If you take 1, Aragorn will take 2, and then you will take 3.  In this scenario, you only have 1 and 3 while Aragorn has 0 and 2. Then Aragorn will win"
                    },
                    {
                        "input": "7 0\n0 1\n0 2\n0 3\n3 4\n4 5\n5 6",
                        "output": "true",
                        "explanation": "Selecting kingdom 1 on your first turn allows you to conquer the kingdoms 1, leaving Aragorn with only kingdom 0. From here, Aragorn must take either 2 or 3. Assuming Aragorn takes 2, you have no adjacent kingdoms. Next turn you skip, now Aragorn can no longer capture 3,4,5,6 as they are no longer adjecent to his kingdom."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Figure out why the first kingdom you select will solely determine the final answer.</p>"
        ],
        "relatedTopics": [
            {
                "name": "Depth-first Search",
                "slug": "depth-first-search"
            },
            {
                "name": "Greedy",
                "slug": "greedy"
            },
            {
                "name": "Recursion",
                "slug": "recursion"
            },
            {
                "name": "Graph",
                "slug": "graph"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}