{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 12752,
            "title": "Gym Freak",
            "titleSlug": "gym-freak_1474831",
            "content": "<h4 id=\"ninja-is-a-gym-freak-but-during-the-lockdown-he-is-not-able-to-do-gym-he-planned-to-bring-some-gym-equipment-to-his-home-unfortunately-there-is-a-lack-of-gym-equipment-in-the-shop-he-could-only-bring-adjustable-dumbbells-and-an-infinite-number-of-weights-of-a-kgs-and-b-kgs-respectively\">Ninja is a Gym Freak, but during the lockdown, he is not able to do gym. He planned to bring some gym equipment to his home. Unfortunately, there is a lack of gym equipment in the shop. He could only bring adjustable dumbbells and an infinite number of weights of  &#39;A&#39; kgs and &#39;B&#39; kgs, respectively.</h4>\n\n<h4 id=\"his-friend-john-also-joined-him-in-the-workout-ninja-wanted-to-lift-a-dumbbell-of-k-kgs-by-combining-weights-of-a-kgs-and-b-kgs-he-can-choose-any-number-of-weights-of-a-kgs-or-b-kgs-possibly-0-each-being-interested-in-maths-john-challenged-him-to-find-the-total-number-of-different-ways-to-make-a-dumbbell-of-k-kgs-by-combining-weights-of-a-kgs-and-b-kgs\">His friend, John, also joined him in the workout. Ninja wanted to lift a dumbbell of &#39;K&#39; kgs by combining weights of &#39;A&#39; kgs and &#39;B&#39; kgs. He can choose any number of weights of &#39;A&#39; kgs or &#39;B&#39; kgs, possibly 0 each. Being interested in Maths, John challenged him to find the total number of different ways to make a dumbbell of &#39;K&#39; kgs by combining weights of &#39;A&#39; kgs and &#39;B&#39; kgs.</h4>\n\n<h4 id=\"ninja-is-not-proficient-in-maths-can-you-help-ninja-to-find-out-the-answer\">Ninja is not proficient in Maths. Can you help Ninja to find out the answer?</h4>\n\n<h5 id=\"input-format\">Input Format :</h5>\n\n<pre><code>The first line of input contains an integer ‘T’, denoting the number of test cases. The test cases follow.\n\nThe first line contains three space-separated integers, ‘A’, ‘B’, and ‘K’, denoting the first weight that he bought, the second weight that he bought, and the weight he wants to lift, respectively.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format :</h5>\n\n<pre><code>For each test case, print the number of ways in which Ninja can lift the dumbbell of K kgs by a combination of A and B kg weights.\n\nPrint the output of each test case in a separate line.\n</code></pre>\n\n<h5 id=\"note\">Note :</h5>\n\n<pre><code>You are not required to print the expected output, it has already been taken care of. Just implement the function.\n\nTwo ways are considered different if the number of times a is used or the number of times b is used is different in the two ways.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints :</h5>\n\n<pre><code>1&lt;= T &lt;= 10^4\n1 &lt;= A, B &lt;= 10^9\n0 &lt;= K &lt;= 10^9\n\nWhere ’T’ is the number of test cases, &#39;A&#39; is the first weight that Ninja bought, ‘B’ is the second weight that Ninja bought, and ‘K’ is the weight Ninja wants to lift respectively.\n\n\nTime Limit: 1 sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1 :</h5>\n\n<pre><code>2\n2 3 5\n2 3 12\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1 :</h5>\n\n<pre><code>1\n3\n</code></pre>\n\n<h5 id=\"explanation-for-sample-input-1\">Explanation for Sample Input 1 :</h5>\n\n<pre><code>In the first test case, the weights that Ninja bought are 2 and 3 kgs. The weight that he wants to lift is 5 kgs. There is only one way to make the combination of 5 kgs using both weights by choosing one weight of each type. So, the answer is 1.\n\nIn the second test case, the weights that Ninja bought are 2 and 3 kgs. The weight that he wants to lift is 12 kgs. There are three ways to make the combination of 12 kgs. The first way is to take 6 weights of 2 kgs each, the second way is to take 4 weights of 3 kgs, and the last way is to take two weights of 3 kgs each and three weights of 2 kgs each. So, the answer is 3. \n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2 :</h5>\n\n<pre><code>2\n4 5 10\n3 4 12\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2 :</h5>\n\n<pre><code>1\n2\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Medium",
            "likes": -7,
            "dislikes": "NA",
            "rephrased": {
                "body": "Ninja wants to lift a dumbbell of 'K' kgs using an infinite number of weights of 'A' kgs and 'B' kgs. Find the number of different ways to achieve the target weight 'K' by combining 'A' and 'B' weights. Each weight can be used zero or more times.",
                "constraints": [
                    "1 <= T <= 10^4",
                    "1 <= A, B <= 10^9",
                    "0 <= K <= 10^9",
                    "Time Limit: 1 sec"
                ],
                "testcases": [
                    {
                        "input": "2 3 5",
                        "output": "1",
                        "explanation": "We need to find ways to obtain 5 using weights of 2 and 3. Only one combination exists: one weight of 2 and one weight of 3 (2*1 + 3*1 = 5)."
                    },
                    {
                        "input": "2 3 12",
                        "output": "3",
                        "explanation": "We need to find ways to obtain 12 using weights of 2 and 3. Three combinations exist: (6 weights of 2 and 0 of 3 -> 2*6 + 3*0 = 12), (0 weights of 2 and 4 of 3 -> 2*0 + 3*4 = 12), (3 weights of 2 and 2 of 3 -> 2*3 + 3*2 = 12)."
                    },
                    {
                        "input": "4 5 10",
                        "output": "1",
                        "explanation": "We need to find ways to obtain 10 using weights of 4 and 5. Only one combination exists: (0 weights of 4 and 2 of 5 ) -> 4*0 + 5*2 = 10, (2 weights of 4 and 0.4 of 5) -> 4*2 + 5*0.4 = 10 This is wrong since we have to take whole number of weights i.e 0,1,2,3,.... so there will only be 1 way that is 0 weights of 4 and 2 of 5 -> 4*0 + 5*2 = 10."
                    },
                    {
                        "input": "3 4 12",
                        "output": "2",
                        "explanation": "We need to find ways to obtain 12 using weights of 3 and 4. Two combinations exist: (4 weights of 3 and 0 of 4 -> 3*4 + 4*0 = 12), (0 weights of 3 and 3 of 4 -> 3*0 + 4*3 = 12)."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Can you figure out the mathematical equation of the given problem?</p>",
            "<p>Can you find one of the weights and then find the other weight from the equation?</p>",
            "<p>Can you observe some sequence from the loop? Is it any progressive sequence?</p>",
            "<p>Will it be feasible to divide A, B, and K by the greatest common divisor of A, and B? Will it reduce the time complexity?</p>"
        ],
        "relatedTopics": [
            {
                "name": "Dynamic Programming",
                "slug": "dynamic-programming"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}