{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 7704,
            "title": "Match Number",
            "titleSlug": "match-number_759409",
            "content": "<h4 id=\"given-two-linked-lists-check-whether-they-represent-the-same-number-each-node-of-the-list-represents-part-of-the-whole-integer-which-needs-to-be-matched-return-true-if-the-lists-match-otherwise-return-false\">Given two linked lists, check whether they represent the same number. Each node of the list represents part of the whole integer which needs to be matched. Return True if the lists match, otherwise return False.</h4>\n\n<h5 id=\"input-format\">Input Format:</h5>\n\n<pre><code>The first line of the input contains an integer &#39;T&#39; denoting the number of test cases.\nThe next &#39;2T&#39; line contains some integers each line denotes one linked list. \nElements of the linked list are separated by space. A linked list is terminated by -1.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format:</h5>\n\n<pre><code>For each test case, print True if the given lists match, else print False.\n</code></pre>\n\n<h5 id=\"note\">Note:</h5>\n\n<pre><code>You do not need to print anything, it has already been taken care of. Just implement the function and return the answer.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints:</h5>\n\n<pre><code>1 &lt;= T  &lt;=  10\n1 &lt;= N1 &lt;= 10^4\n1 &lt;= N2 &lt;= 10^4\n\nWhere N1, N2 represents the length of linked list one and two respectively.\n\nTime Limit: 1 sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1:</h5>\n\n<pre><code>2\n0 0 1 2 -1\n0 1 2 -1\n43 5 678 -1\n4 3 56 87 -1\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1:</h5>\n\n<pre><code>True\nFalse\n</code></pre>\n\n<h5 id=\"explanation-for-sample-input-1\">Explanation For Sample Input 1:</h5>\n\n<pre><code>Here we have 2 test cases, hence there are 2 pairs, a total of 4 linked lists. The second line and third line depict the first pair and the fourth line and the fifth line depicts the second pair of the linked list.\n\nTest Case 1: The first linked list of the first pair represents the number 0012 which is 12 and the second linked list of the first pair represents the number 012 which is 12. Because both the linked list represents the same number hence the answer is true.\n\nTest case 2: The first linked list of the second pair represents the number 435678 and the second linked list of the second pair represents the number 435687. Because both the linked list represents the different numbers hence the answer is false.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2:</h5>\n\n<pre><code>2\n1 2 4 0 -1\n12 4 2 -1\n6 0 2 -1 \n2 4 1 -1\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2:</h5>\n\n<pre><code>False\nFalse\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Easy",
            "likes": 3,
            "dislikes": "NA",
            "rephrased": {
                "body": "Given two linked lists, determine if they represent the same numerical value. Each node in the linked list represents a digit of an integer. Return `True` if the two linked lists represent the same number, and `False` otherwise.",
                "constraints": [
                    "1 <= T <= 10 (where T is the number of test cases)",
                    "1 <= N1 <= 10^4 (where N1 is the length of the first linked list)",
                    "1 <= N2 <= 10^4 (where N2 is the length of the second linked list)",
                    "Time Limit: 1 second"
                ],
                "testcases": [
                    {
                        "input": "2\n0 0 1 2 -1\n0 1 2 -1\n43 5 678 -1\n4 3 56 87 -1",
                        "output": "True\nFalse",
                        "explanation": "Test Case 1: The first list represents 0012, which is 12. The second list represents 012, which is also 12.  Therefore, they are the same.\nTest Case 2: The first list represents 435678. The second list represents 435687. Therefore, they are different."
                    },
                    {
                        "input": "2\n1 2 4 0 -1\n12 4 2 -1\n6 0 2 -1 \n2 4 1 -1",
                        "output": "False\nFalse",
                        "explanation": "Test Case 1: The first list represents 1240. The second list represents 1242. Therefore, they are different.\nTest Case 2: The first list represents 602. The second list represents 241. Therefore, they are different."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Try recursively converting both the linked list elements to something whole such as string which you can compare.</p>"
        ],
        "relatedTopics": [
            {
                "name": "Linked List",
                "slug": "linked-list"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}