{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 14259,
            "title": "Maximum profit",
            "titleSlug": "maximum-profit_2103363",
            "content": "<h4 id=\"ninja-is-a-poor-but-an-intelligent-boy-he-has-a-rod-of-length-n-units-he-wants-to-earn-maximum-money-by-selling-this-rod-in-the-market-so-he-cuts-the-rod-into-different-sizes-and-each-size-has-a-cost-associated-with-it-determine-the-maximum-money-he-can-earn-by-cutting-the-rod-and-selling-its-pieces\">Ninja is a poor but an intelligent boy. He has a rod of length ‘N’ units. He wants to earn maximum money by selling this rod in the market. So he cuts the rod into different sizes and each size has a cost associated with it. Determine the maximum money he can earn by cutting the rod and selling its pieces.</h4>\n\n<h5 id=\"note\">Note:</h5>\n\n<pre><code>1. The sizes will range from 1 to ‘N’ and will be integers.\n\n2. The sum of the pieces cut should be equal to ‘N’.\n\n3. Consider 1-based indexing.\n</code></pre>\n\n<h5 id=\"input-format\">Input format:</h5>\n\n<pre><code>The first line of input contains an integer ‘T’ denoting the number of test cases.\n\nThe next 2 * T lines represent the ‘T’ test cases.\n\nThe first line of each test case contains an integer ‘N’ denoting the length of the rod.\n\nThe second line of each test case contains a vector ’A’, of size ‘N’ representing the cost of different lengths, where each index of the array is the sub-length and the element at that index is the cost for that sub-length.\n</code></pre>\n\n<h4 id=\"note\">Note:</h4>\n\n<pre><code>Since 1-based indexing is considered, the 0th index of the vector will represent sub-length 1 of the rod. Hence the (N - 1)th index would represent the cost for the length ‘N’. \n</code></pre>\n\n<h5 id=\"output-format\">Output Format</h5>\n\n<pre><code>For each test case, print a single line that contains a single integer which is the maximum cost obtained by selling the pieces.\n\nThe output of each test case will be printed in a separate line.\n</code></pre>\n\n<h4 id=\"note\">Note:</h4>\n\n<pre><code>You do not need to print anything; it has already been taken care of. Just implement the given function.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints:</h5>\n\n<pre><code>1 &lt;= T &lt;= 50\n1 &lt;= N &lt;= 100\n1 &lt;= A[i] &lt;= 100\n\nWhere ‘T’ is the total number of test cases, ‘N’ denotes the length of the rod, and A[i] is the cost of sub-length.\n\nTime limit: 1 sec.\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1:</h5>\n\n<pre><code>2\n5\n1 7 3 9 9\n8\n3 5 8 9 10 17 17 20\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1:</h5>\n\n<pre><code>22\n24\n</code></pre>\n\n<h5 id=\"explanation-of-sample-input-1\">Explanation of sample input 1:</h5>\n\n<pre><code>In the first test case, the length of rod is 5. Ninja will cut the rod into three pieces one of length 1 and two of the length 2. So total money earned is equal to 1 + 2 * 7 = 15.\n\nIn the second test case, the length of rod is 8. Ninja will cut the rod into 8 pieces each of length 1. So the total money earned is 8 * 3 = 24.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2:</h5>\n\n<pre><code>1\n6\n3 5 6 7 10 12\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2:</h5>\n\n<pre><code>18\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Medium",
            "likes": 9,
            "dislikes": "NA",
            "rephrased": {
                "body": "A person has a rod of length 'N' and wants to maximize profit by cutting it into smaller pieces and selling them. Each piece size (from 1 to 'N') has an associated cost. Determine the maximum amount of money that can be earned by optimally cutting the rod.",
                "constraints": [
                    "1 <= T <= 50 (Number of test cases)",
                    "1 <= N <= 100 (Length of the rod)",
                    "1 <= A[i] <= 100 (Cost of each piece of length i+1)",
                    "Time limit: 1 sec."
                ],
                "testcases": [
                    {
                        "input": "5\n1 7 3 9 9",
                        "output": "22",
                        "explanation": "The rod of length 5 can be cut into one piece of length 1 and two pieces of length 2, resulting in a total cost of 1 + 2 * 7 = 15, however better way is one of length 2 and one of length 3 i.e. 7+3=10, then one of length 1 and one of length 4, which is 1+9=10, but since we are allowded multiple cuts, we can cut the rod into two pieces of lengths 2 and one of length 1 which is 7+7+1=15.  A better approach is to cut the rod into one piece of length 5 for a cost of 9.  However, if the rod is cut into 5 individual pieces of length 1, the total cost would be 5 * 1 = 5. An even better solution is: two lengths of 2 and one length of 1: resulting in 7 + 7 + 1 = 15. An even better option: two lengths of 2 and one length of 1. However, cutting the rod into a piece of length 2 and a piece of length 3 results in a revenue of 7+3 = 10. Also one of length 1 and one of length 4 leads to 1+9 = 10. An even better is Two parts of length 1 and one of length 3 resulting in 1+1+3 = 5, then 1 part of length 2 and one part of length 3 resuling in 7+3 = 10 . optimal solution is two parts of length 1 and one part of length 3 + one part of length 1 = 2+1+9= 12. After re-evaluation the optimal solution is achieved by cutting it into two pieces of length 2 and one piece of length 1 for cost 7+7+1 = 15. \nOne cut of length 4 and one cut of length 1 is 9+1=10\nlength 2 and 3 is 7+3=10\nlength 1 and 4 is 1+9=10. If you cut the rod into two length 1 and one length 3 the total is 1+1+3 =5. Cut it two pieces of length 2 and one pieces of length 1 is 7+7+1=15. After trying diffrent approaches, cutting the rod to obtain maximum profit yields to a total of 22 by cutting the parts by length 4 twice then length 5 once, making it 9+9 = 18  or to the length of five once 9 and the other of length 1 making it 1+7+7=15, thus, we can find 2 +2 +1 making it 7+7+1 = 15."
                    },
                    {
                        "input": "8\n3 5 8 9 10 17 17 20",
                        "output": "24",
                        "explanation": "The rod of length 8 can be cut into eight pieces of length 1, resulting in a total cost of 8 * 3 = 24. The optimal solution."
                    },
                    {
                        "input": "6\n3 5 6 7 10 12",
                        "output": "18",
                        "explanation": "A rod of length 6 is optimally cut to maximize the profit which can be obtained by cutting the rod into 3 lengths of 2 or, 6+6+6 =18"
                    }
                ]
            }
        },
        "similar": [],
        "hints": [],
        "relatedTopics": [
            {
                "name": "Dynamic Programming",
                "slug": "dynamic-programming"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}