{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 16395,
            "title": "Milk flow",
            "titleSlug": "milk-flow_3130765",
            "content": "<h4 id=\"you-are-going-to-donate-some-milk-to-poor-children-but-being-a-busy-person-you-don-t-have-enough-time-to-give-milk-to-each-child-by-yourself-to-distribute-the-milk-efficiently-you-arrange-children-in-the-following-structure-and-ask-them-to-pass-the-milk\">You are going to donate some milk to poor children. But being a busy person, you don’t have enough time to give milk to each child by yourself. To distribute the milk efficiently, you arrange children in the following structure and ask them to pass the milk.</h4>\n\n<p><img src=\"https://ninjasfiles.s3.amazonaws.com/asset_0000000000000545_1637907016_Milk-flow-problem.png\" alt=\"\">    </p>\n\n<h4 id=\"suppose-you-give-x-liters-of-milk-to-child-1-then-he-will-take-1-liter-for-himself-and-pass-the-remaining-milk-to-child-2-and-child-3-in-equally-half-each-child-repeats-the-same-process-based-on-the-amount-of-milk-they-get-if-a-child-has-less-than-1-liter-of-milk-he-doesnt-pass-anything-to-the-next-child\">Suppose you give &#39;X&#39; liters of milk to child-1, then he will take 1 liter for himself and pass the remaining milk to child-2 and child-3 in equally half. Each child repeats the same process based on the amount of milk they get. If a child has less than 1 liter of milk, he doesn&#39;t pass anything to the next child.</h4>\n\n<h4 id=\"e-g-if-child-2-has-6-liters-of-milk-he-keeps-1-liter-for-himself-and-passes-2-5-liters-to-child-4-and-2-5-liters-to-child-5-it-can-be-seen-that-child-5-gets-milk-from-child-2-and-child-3-both-but-he-can-take-a-total-of-1-liter-for-himself-and-have-to-pass-the-remaining\">E.g., If child-2 has 6 liters of milk, he keeps 1 liter for himself and passes 2.5 liters to child-4 and 2.5 liters to child-5. It can be seen that child-5 gets milk from child-2 and child-3 both. But he can take a total of 1 liter for himself and have to pass the remaining.</h4>\n\n<h4 id=\"if-x-liters-of-milk-is-given-to-child-1-find-the-amount-of-milk-a-child-has-standing-in-the-n-th-row-from-top-to-bottom-at-m-th-position-from-left-to-right\">If &#39;X&#39; liters of milk is given to child-1, find the amount of milk a child has, standing in the &#39;N&#39;-th row (from top to bottom) at &#39;M&#39;-th position (from left to right).</h4>\n\n<h5 id=\"input-format\">Input Format:</h5>\n\n<pre><code>The first line contains &#39;T&#39;, denoting the number of tests.\nFor each Test :\n    The only line contains three space-separated integers &#39;X&#39;, &#39;N&#39; and &#39;M&#39;, denoting amount of milk, row number and position of child from left, respectively.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format:</h5>\n\n<pre><code>For each test, print one floating number (with 6 digits of precision), denoting the amount of milk a child has, standing in &#39;N&#39;-th row at &#39;M&#39;-th position.\n</code></pre>\n\n<h5 id=\"note\">Note:</h5>\n\n<pre><code>You are not required to print the expected output. It has already been taken care of. Just implement the function.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints -</h5>\n\n<pre><code>1 &lt;= &#39;T&#39; &lt;= 10\n1 &lt;= &#39;M&#39; &lt;= &#39;N&#39; &lt;= 10^3\n0 &lt;= &#39;X&#39; &lt;= 10^4\nSum of &#39;N&#39; and sum of &#39;M&#39; over all test cases doesn&#39;t exceed 10^3.\n\nTime Limit: 1 sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1:</h5>\n\n<pre><code>2\n2 2 1\n8 3 2\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1:</h5>\n\n<pre><code>0.500000\n1.000000\n</code></pre>\n\n<h5 id=\"explanation-for-sample-input-1\">Explanation for Sample Input 1:</h5>\n\n<pre><code>For case 1:\nA child standing in N = 2 at M = 1, i.e., in the second row at first position, is child-2. A total of 2 liters of milk is given to child-1. He keeps one liter for himself and passes 0.5 liters to child-2 and child-3 each. Hence child-2 has 0.5 liters of milk.\n\nFor Case 2:\nA child standing in N = 3 at M = 2, i.e., in the third row at second position, is child-5. \nchild-1 gets 8 liters and passes 3.5 liters to child-2 and child-3 each.\nchild-2 gets 3.5 liters from child-1 and passes 1.25 liters to child-4 and child-5 each.\nchild-3 gets 3.5 liters from child-1 and passes 1.25 liters to child-5 and child-6 each.\nchild-5 gets a total of 2.5 liters (1.25 from child-2 and 1.25 from child-3). He keeps 1 liter and passes the remaining to the next. Hence child-5 has 1 liter of milk.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2:</h5>\n\n<pre><code>3\n6 3 3\n6 4 2\n1 2 2\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2:</h5>\n\n<pre><code>0.750000\n0.250000\n0.000000\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Medium",
            "likes": 7,
            "dislikes": "NA",
            "rephrased": {
                "body": "You are distributing milk to children arranged in a tree-like structure. The first child receives 'X' liters of milk. Each child keeps 1 liter (if they have at least 1 liter) and evenly distributes the remaining milk to their two children below. If a child receives less than 1 liter, they keep it all and pass nothing on. Determine the amount of milk a child at row 'N' and position 'M' has.",
                "constraints": [
                    "1 <= T <= 10",
                    "1 <= M <= N <= 1000",
                    "0 <= X <= 10000",
                    "Sum of N and sum of M over all test cases doesn't exceed 1000",
                    "Time Limit: 1 sec"
                ],
                "testcases": [
                    {
                        "input": "2 2 1",
                        "output": "0.500000",
                        "explanation": "Child 1 receives 2 liters, keeps 1, and passes 0.5 liters to Child 2 and 0.5 liters to Child 3.  Child 2 is at row 2, position 1, and receives 0.5 liters."
                    },
                    {
                        "input": "8 3 2",
                        "output": "1.000000",
                        "explanation": "Child 1 receives 8 liters, keeps 1, and passes 3.5 liters to Child 2 and Child 3. Child 2 receives 3.5 liters, keeps 1, and passes 1.25 liters to Child 4 and Child 5. Child 3 receives 3.5 liters, keeps 1, and passes 1.25 liters to Child 5 and Child 6. Child 5 is at row 3, position 2, and receives 1.25 liters from Child 2 and 1.25 liters from Child 3, for a total of 2.5 liters. Child 5 keeps 1 liter."
                    },
                    {
                        "input": "6 3 3",
                        "output": "0.750000",
                        "explanation": "Child 1 receives 6 liters, keeps 1, and passes 2.5 liters to Child 2 and Child 3. Child 3 receives 2.5 liters, keeps 1, and passes 0.75 liters to Child 5 and Child 6. Child 6 is at row 3 position 3, so it gets 0.75 liters."
                    },
                    {
                        "input": "6 4 2",
                        "output": "0.250000",
                        "explanation": "Child 1 receives 6 liters, keeps 1, and passes 2.5 liters to Child 2 and Child 3. Child 2 receives 2.5 liters, keeps 1, and passes 0.75 liters to Child 4 and Child 5. Child 4 receives 0.75 liters. Row 4 position 2, so it gets 0.75 liters."
                    },
                    {
                        "input": "1 2 2",
                        "output": "0.000000",
                        "explanation": "Child 1 receives 1 liter, keeps 1, and passes 0.0 liters to Child 2 and Child 3.  Therefore Child 3 receives 0 liter which is at row 2 position 2."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Implement the flow of milk from the first row to N-th row.</p>"
        ],
        "relatedTopics": [
            {
                "name": "Math",
                "slug": "math"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}