{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 11945,
            "title": "Minimum Boats to Cross River",
            "titleSlug": "minimum-boats-to-cross-river_1402321",
            "content": "<h4 id=\"ninja-and-his-friends-are-on-a-trip-they-have-come-across-a-river-and-want-to-cross-the-river-with-the-help-of-boats-there-are-a-total-of-n-people-on-the-trip-including-ninja-himself-the-weight-of-each-person-is-given-in-an-array-arr-one-boat-can-accommodate-at-most-two-persons-only-if-the-sum-of-their-weight-does-not-exceed-l-i-e-the-maximum-weight-capacity-of-the-boat-otherwise-the-boat-will-accommodate-only-one-person-given-the-weight-of-each-person-and-the-maximum-weight-capacity-l-your-task-is-to-find-the-minimum-number-of-boats-required-to-ensure-that-everyone-crosses-the-river\">Ninja and his friends are on a trip. They have come across a river and want to cross the river with the help of boats. There are a total of &#39;N&#39; people on the trip including Ninja himself. The weight of each person is given in an array &#39;ARR&#39;. One boat can accommodate at most two persons only if the sum of their weight does not exceed &#39;L&#39;, i.e., the maximum weight capacity of the boat, otherwise, the boat will accommodate only one person. Given the weight of each person and the maximum weight capacity &#39;L&#39;, your task is to find the minimum number of boats required to ensure that everyone crosses the river.</h4>\n\n<h5 id=\"input-format\">Input Format:</h5>\n\n<pre><code>The first line of the input contains an integer, &#39;T,’ denoting the number of test cases.\n\nThe first line of each test case contains two space-separated integers, &#39;N&#39; and &#39;L&#39;, denoting the number of elements in the array &#39;ARR&#39;, and the maximum weight capacity of one boat respectively.\n\nThe second line of each test case contains &#39;N&#39; space-separated integers denoting the elements of the array &#39;ARR&#39;.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format:</h5>\n\n<pre><code>For each test case, print a single integer - the minimum number of boats required.    \n\nPrint the output of each test case in a separate line.\n</code></pre>\n\n<h5 id=\"note\">Note:</h5>\n\n<pre><code>You do not need to print anything, it has already been taken care of. Just implement the given function.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints:</h5>\n\n<pre><code>1 &lt;= T &lt;= 10\n1 &lt;= L &lt;= 10^9\n1 &lt;= N &lt;= 10^5\n1 &lt;= ARR[i] &lt;= L\n\nWhere &#39;T&#39; denotes the number of test cases, &#39;N&#39; denotes the number of elements in the array, &#39;L&#39; denotes the maximum weight capacity of one boat, and &#39;ARR[i]&#39; denotes the &#39;i&#39;th&#39; element of the array &#39;ARR&#39;.\n\nTime Limit: 1 sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1:</h5>\n\n<pre><code>2\n4 5 \n2 4 3 3\n6 8\n5 1 2 7 8 5\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1:</h5>\n\n<pre><code>3\n4\n</code></pre>\n\n<h5 id=\"explanation-for-sample-input-1\">Explanation For Sample Input 1:</h5>\n\n<pre><code>For the first test case, \nIf the person having weight 2 and one of the people having weight 3 goes in the same boat, while the other two persons cross the river using different boats. Then the total number of boats used will be 3, which is the minimum possible. Hence, the answer is 3 in this case.\n\nFor the second test case,\nIf the person having weight 2 and one of the person having weight 5 goes in the same boat and the persons having weight 1 and 7 goes in the same boat, while the other two persons cross the river using different boats. Then the total number of boats used will be 4, which is the minimum possible. Hence, the answer is 4 in this case.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2:</h5>\n\n<pre><code>2\n5 6\n3 4 5 6 6 \n6 3 \n1 3 1 2 2 3\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2:</h5>\n\n<pre><code>5\n4\n</code></pre>\n\n<h5 id=\"explanation-for-sample-input-2\">Explanation For Sample Input 2:</h5>\n\n<pre><code>For the first test case, \nNo two or more can go on same boat. Hence, the answer is 5 in this case.\n\nFor the second test case,\nIf the person having weight 1 and one of the person having weight 2 goes in the same boat and the persons having weight 1 and 2 goes in the same boat, while the other two persons cross the river using different boats. Then the total number of boats used will be 4, which is the minimum possible. Hence, the answer is 4 in this case.\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Easy",
            "likes": -1,
            "dislikes": "NA",
            "rephrased": {
                "body": "A group of N friends, including Ninja, needs to cross a river. They have N weights represented in an array ARR. Each boat can carry at most two people, but only if their combined weight is less than or equal to the boat's maximum weight capacity, L. Otherwise, the boat can only carry one person. Given ARR (the weights of the N people) and L (the maximum weight capacity), determine the minimum number of boats required for everyone to cross the river.",
                "constraints": [
                    "1 <= T <= 10 (Number of test cases)",
                    "1 <= L <= 10^9 (Maximum weight capacity)",
                    "1 <= N <= 10^5 (Number of people)",
                    "1 <= ARR[i] <= L (Weight of each person)"
                ],
                "testcases": [
                    {
                        "input": "4 5\n2 4 3 3",
                        "output": "3",
                        "explanation": "One possible solution: A boat carries the person weighing 2 and one of the people weighing 3 (total weight 5 <= L).  The other two people each take a boat individually. This requires 3 boats."
                    },
                    {
                        "input": "6 8\n5 1 2 7 8 5",
                        "output": "4",
                        "explanation": "One possible solution: A boat carries the people weighing 1 and 7 (total weight 8 <= L). Another boat carries the people weighing 2 and 5 (total weight 7 <= L). The remaining people weighing 5 and 8 each take a boat individually. This requires 4 boats."
                    },
                    {
                        "input": "5 6\n3 4 5 6 6",
                        "output": "5",
                        "explanation": "In this test case, no two people can be paired in a single boat without exceeding the weight limit of 6. Therefore, each person needs their own boat, resulting in 5 boats."
                    },
                    {
                        "input": "6 3\n1 3 1 2 2 3",
                        "output": "4",
                        "explanation": "One possible solution: Pair the two lightest people (1 and 1) in one boat. Then pair one 2 with one 1 in another boat (the people weighing 1 and 2). The remaining people (2, 3, 3) need boats to carry each of them (2 will use a boat and 3 and 3 will each use a boat). Thus total boats required is 4."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Among all the persons who have not been assigned a boat, check if the heaviest weight person can be paired with the least weight person.</p>"
        ],
        "relatedTopics": [
            {
                "name": "Sorting",
                "slug": "sorting"
            },
            {
                "name": "Greedy",
                "slug": "greedy"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}