{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 10388,
            "title": " Ninja And His Old Friends",
            "titleSlug": "ninja-and-his-old-friends_1214934",
            "content": "<h4 id=\"ninja-wants-to-meet-his-n-old-friends-standing-in-a-row-all-the-friends-along-with-ninja-are-very-happy-because-they-are-meeting-after-a-long-time-the-happiness-of-each-friend-can-be-represented-as-a-positive-integer-initially-ninja-has-some-happiness-value-k-ninja-shakes-hands-with-all-of-his-n-friends-standing-in-a-row-one-by-one\">Ninja wants to meet his ‘N’ old friends standing in a row. All the friends along with Ninja are very happy because they are meeting after a long time. The happiness of each friend can be represented as a positive integer. Initially,  Ninja has some happiness value ‘K’. Ninja shakes hands with all of his ‘N’ friends standing in a row one by one.</h4>\n\n<h4 id=\"while-shaking-hands-if-the-happiness-value-of-ninja-matches-with-that-of-his-friend-then-the-happiness-value-of-ninja-becomes-double-ninja-wants-to-calculate-his-happiness-value-after-he-shakes-hands-with-all-of-his-friends\">While shaking hands if the happiness value of Ninja matches with that of his friend, then the happiness value of Ninja becomes double. Ninja wants to calculate his happiness value after he shakes hands with all of his friends.</h4>\n\n<h4 id=\"for-example-for-friends-3-2-1-4-and-k-2-following-are-the-results-after-each-hand-shake\">For Example: For ‘FRIENDS’ = [3, 2, 1, 4]. And ‘K’ = 2, following are the results after each hand shake:</h4>\n\n<pre><code>1. At index 0 the happiness value of his friend is 3 and the happiness value of Ninja is 2. Both are unequal so ‘K’ remains the same.\n2. At index 1 the happiness value of his friend is 2 and the happiness value of Ninja is 2. Both are equal so ‘K’ becomes 4.\n3. At index 2 the happiness value of his friend is 1 and the happiness value of Ninja is 4. Both are unequal so ‘K’ remains the same.\n4. At index 3 the happiness value of his friend is 4 and the happiness value of Ninja is 4. Both are equal so ‘K’ becomes 8.\n</code></pre>\n\n<h4 id=\"as-ninja-is-busy-with-his-friends-so-he-needs-your-help-can-you-help-ninja-to-find-his-final-happiness-value-after-all-the-handshakes\">As Ninja is busy with his friends so he needs your help. Can you help  Ninja to find his final happiness value after all the handshakes?</h4>\n\n<h5 id=\"input-format\">Input Format:</h5>\n\n<pre><code>The first line contains an integer &#39;T&#39; which denotes the number of test cases or queries to be run. Then the test cases follow.\n\nThe first line of each test case contains two integers ‘N&#39; and ‘K’ denoting the number of friends and the initial happiness value ofNinja respectively.\n\nThe second line of each test case contains &#39;N&#39; single space-separated integers, denoting the happiness value of each friend.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format:</h5>\n\n<pre><code>For each test case, print an integer denoting the final happiness value of Ninja after all the handshakes.\n\nThe output of each test case will be printed in a separate line.\n</code></pre>\n\n<h4 id=\"note\">Note:</h4>\n\n<pre><code>You are not required to print the expected output, and it has already been taken care of. Just implement the function.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints:</h5>\n\n<pre><code>1 &lt;= T &lt;= 100\n1 &lt;= N &lt;= 10 ^ 4\n1 &lt;= K &lt;= 10 ^ 3\n1 &lt;= FRIENDS[i] &lt;= 10 ^ 6\n\nWhere &#39;FRIENDS[i]&#39; denotes the happiness value of the friend at the ‘i’th index, respectively.\n\nTime Limit: 1 sec \n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1:</h5>\n\n<pre><code>2\n3 1\n1 2 4 \n2 4 \n1 2\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1:</h5>\n\n<pre><code>8\n4 \n</code></pre>\n\n<h5 id=\"explanation-of-sample-input-1\">Explanation of Sample Input 1:</h5>\n\n<pre><code>For the first test case:\n1. At index 0 the happiness value of his friend is 1 and the happiness value of Ninja is 1. Both are equal so ‘K’ becomes 2.\n2. At index 1 the happiness value of his friend is 2 and the happiness value of Ninja is 2. Both are equal so ‘K’ becomes 4.\n3. At index 2 the happiness value of his friend is 4 and the happiness value of Ninja is 4. Both are equal so ‘K’ becomes 8.\n\nFor the second test case:\n1. At index 0 the happiness value of his friend is 1 and the happiness value of Ninja is 4. Both are unequal so ‘K’ remains the same. \n2. At index 1 the happiness value of his friend is 2 and the happiness value of Ninja is 4. Both are unequal so ‘K’ remains the same. \n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2:</h5>\n\n<pre><code>2\n2 5\n5 5 \n3 8\n2 4 8 \n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2:</h5>\n\n<pre><code>10\n16\n</code></pre>\n\n<h5 id=\"explanation-of-sample-input-2\">Explanation of Sample Input 2:</h5>\n\n<pre><code>For the first test case:\n1. At index 0 the happiness value of his friend is 5 and the happiness value of Ninja is 5. Both are equal so ‘K’ becomes 10.\n2. At index 1 the happiness value of his friend is 5 and the happiness value of Ninja is 10. Both are unequal so ‘K’ remains the same.    \n\nFor the second test case:\n1. At index 0 the happiness value of his friend is 2 and the happiness value of Ninja is 8. Both are unequal so ‘K’ remains the same.\n2. At index 1 the happiness value of his friend is 4 and the happiness value of Ninja is 8. Both are unequal so ‘K’ remains the same.\n3. At index 2 the happiness value of his friend is 8 and the happiness value of Ninja is 8. Both are equal so ‘K’ becomes 16.\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Easy",
            "likes": 5,
            "dislikes": "NA",
            "rephrased": {
                "body": "Ninja wants to meet his N old friends standing in a row. Each friend has a happiness value (a positive integer). Ninja starts with an initial happiness value K. He shakes hands with each friend, one by one. If Ninja's happiness value matches the happiness value of the friend he's shaking hands with, his happiness doubles. The goal is to calculate Ninja's final happiness value after shaking hands with all his friends.",
                "constraints": [
                    "1 <= T <= 100",
                    "1 <= N <= 10 ^ 4",
                    "1 <= K <= 10 ^ 3",
                    "1 <= FRIENDS[i] <= 10 ^ 6",
                    "Where 'FRIENDS[i]' denotes the happiness value of the friend at the ‘i’th index, respectively.",
                    "Time Limit: 1 sec"
                ],
                "testcases": [
                    {
                        "input": "3 1\n1 2 4",
                        "output": "8",
                        "explanation": "Ninja starts with happiness 1.\n- Friend 1: Happiness is 1, Ninja's happiness is 1. They match, so Ninja's happiness becomes 2.\n- Friend 2: Happiness is 2, Ninja's happiness is 2. They match, so Ninja's happiness becomes 4.\n- Friend 3: Happiness is 4, Ninja's happiness is 4. They match, so Ninja's happiness becomes 8.\nFinal happiness: 8"
                    },
                    {
                        "input": "2 4\n1 2",
                        "output": "4",
                        "explanation": "Ninja starts with happiness 4.\n- Friend 1: Happiness is 1, Ninja's happiness is 4. They don't match, so Ninja's happiness remains 4.\n- Friend 2: Happiness is 2, Ninja's happiness is 4. They don't match, so Ninja's happiness remains 4.\nFinal happiness: 4"
                    },
                    {
                        "input": "2 5\n5 5",
                        "output": "10",
                        "explanation": "Ninja starts with happiness 5.\n- Friend 1: Happiness is 5, Ninja's happiness is 5. They match, so Ninja's happiness becomes 10.\n- Friend 2: Happiness is 5, Ninja's happiness is 10. They don't match, so Ninja's happiness remains 10.\nFinal happiness: 10"
                    },
                    {
                        "input": "3 8\n2 4 8",
                        "output": "16",
                        "explanation": "Ninja starts with happiness 8.\n- Friend 1: Happiness is 2, Ninja's happiness is 8. They don't match, so Ninja's happiness remains 8.\n- Friend 2: Happiness is 4, Ninja's happiness is 8. They don't match, so Ninja's happiness remains 8.\n- Friend 3: Happiness is 8, Ninja's happiness is 8. They match, so Ninja's happiness becomes 16.\nFinal happiness: 16"
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Try to use the brute force approach in this problem</p>"
        ],
        "relatedTopics": [
            {
                "name": "Arrays",
                "slug": "arrays"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}