{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 10177,
            "title": "Ninja and Chocolates ",
            "titleSlug": "ninja-and-chocolates_1170765",
            "content": "<h4 id=\"ninja-is-hungry-and-wants-to-eat-his-favorite-chocolates-but-his-mother-won-t-let-him-eat-since-he-has-already-eaten-enough-chocolates-there-are-n-jars-filled-with-chocolates-his-mother-has-gone-to-the-market-and-will-home-come-after-m-minutes-the-ninja-can-eat-up-to-x-chocolates-per-minute-every-minute-when-his-mother-is-not-there-he-chooses-any-jar-and-takes-out-x-chocolates-from-that-jar-and-eats-them-if-any-jar-has-less-than-x-chocolates-then-he-eats-all-of-the-chocolates-in-that-jar-but-won-t-eat-any-more-chocolates-during-this-minute-your-task-is-to-print-x-the-minimum-chocolate-eating-speed-of-ninja-such-that-he-eats-all-the-chocolates-within-m-minutes-before-his-mother-comes-back\">Ninja is hungry and wants to eat his favorite chocolates but his mother won’t let him eat since he has already eaten enough chocolates. There are ‘N’ jars filled with chocolates. His mother has gone to the market and will home come after ‘M’ minutes. The ninja can eat up to ‘X’ chocolates per minute. Every minute when his mother is not there, he chooses any jar and takes out ‘X’ chocolates from that jar, and eats them. If any jar has less than ‘X’ chocolates, then he eats all of the chocolates in that jar but won’t eat any more chocolates during this minute. Your task is to print ‘X’ the minimum chocolate-eating speed of Ninja such that he eats all the chocolates within ‘M’ minutes before his mother comes back.</h4>\n\n<h5 id=\"input-format\">Input Format :</h5>\n\n<pre><code>The first line of the input contains an integer &#39;T&#39; denoting the number of test cases.\n\nThe first line of each test case contains two space-separated integers &#39;N&#39; and &#39;M&#39;, the number of jars, and the minutes after which his mother comes back.\n\nThe second line of each test case contains &#39;N&#39; space-separated integers, the number of chocolates present in &#39;N&#39; jars.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format:</h5>\n\n<pre><code>For every test case, the only line of output should contain an integer &#39;X&#39;, the minimum chocolate-eating speed of Ninja as described in the problem statement. \n\nPrint the output of each test case in a separate line.\n</code></pre>\n\n<h5 id=\"note\">Note :</h5>\n\n<pre><code>You do not need to print anything, it has already been taken care of. Just implement the given function. \n</code></pre>\n\n<h5 id=\"constraints\">Constraints :</h5>\n\n<pre><code>1 &lt;= T &lt;= 5\n1 &lt;=  N &lt;= 10^6\nN &lt;= M &lt;= 10^9\n1 &lt;= chocolates[i] &lt;= 10^9\n\nTime limit: 1 sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1 :</h5>\n\n<pre><code>1\n4 10\n5 4 3 2 \n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1 :</h5>\n\n<pre><code> 2\n</code></pre>\n\n<h5 id=\"explanation-of-sample-input-1\">Explanation of Sample Input 1 :</h5>\n\n<pre><code>If Ninja eats at a speed of 2 chocolates per minute, he can finish before his mother comes back. There are many ways in which he can eat these chocolates. One such way is that he takes 3 minutes to eat all the chocolates(5) from 1st Jar, 2 minutes to eat all the chocolates(4) from the 2nd Jar,  2 minutes to eat all the chocolates(3) from 3rd Jar, and finally, take 1 minute to eat all the chocolates from the final jar which has 2 chocolates. The total time taken will be 3+2+2+1 = 8 which is less than 10.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2 :</h5>\n\n<pre><code>1\n5 5\n3 9 3 4 4\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2 :</h5>\n\n<pre><code>9\n</code></pre>\n\n<h5 id=\"explanation-of-sample-input-2\">Explanation of Sample Input 2 :</h5>\n\n<pre><code>If Ninja eats at a speed of 9 chocolates per minute, he can finish before his mother comes back. One such way is that he can start eating chocolates from the 2nd jar and take 1 minute to eat all the 9 chocolates from that jar and 1 minute each for all other jars since each jar has less than 9 chocolates. Hence, the total time will be 1+1+1+1+1 = 5, which is just in time.\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Medium",
            "likes": 7,
            "dislikes": "NA",
            "rephrased": {
                "body": "A ninja is hungry and wants to eat chocolates, but his mother limits his intake. There are 'N' jars filled with chocolates. His mother is away for 'M' minutes. The ninja can eat 'X' chocolates per minute. Each minute, he chooses a jar and eats 'X' chocolates from it. If a jar has fewer than 'X' chocolates, he eats them all and stops for that minute. Determine the minimum chocolate-eating speed 'X' required for the ninja to eat all the chocolates within 'M' minutes.",
                "constraints": [
                    "1 <= T <= 5",
                    "1 <= N <= 10^6",
                    "N <= M <= 10^9",
                    "1 <= chocolates[i] <= 10^9"
                ],
                "testcases": [
                    {
                        "input": "4 10\n5 4 3 2",
                        "output": "2",
                        "explanation": "At a speed of 2 chocolates per minute, the ninja can finish within 10 minutes. He can eat from the jars in sequence. Jar 1 takes 3 minutes (5 chocolates), Jar 2 takes 2 minutes (4 chocolates), Jar 3 takes 2 minutes (3 chocolates), and Jar 4 takes 1 minute (2 chocolates). The total time is 3 + 2 + 2 + 1 = 8 minutes, which is less than 10."
                    },
                    {
                        "input": "5 5\n3 9 3 4 4",
                        "output": "9",
                        "explanation": "At a speed of 9 chocolates per minute, the ninja can finish within 5 minutes. He can eat the second jar in 1 minute. Then eats from each other jar once, taking 1 minute each as they contain less than or equal to 9 chocolates, taking 5 minutes in total"
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Iterate on eating-speed to find minimum eating-speed.</p>",
            "<p>Think about how you can decrease the search space.</p>"
        ],
        "relatedTopics": [
            {
                "name": "Binary Search",
                "slug": "binary-search"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}