{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 10727,
            "title": "Ninja and his meetings",
            "titleSlug": "ninja-and-his-meetings_1263693",
            "content": "<h4 id=\"ninja-has-recently-started-a-startup-in-his-startup-there-is-only-one-conference-room-for-a-meeting-ninja-receives-an-array-list-meetings-of-back-to-back-appointment-requests-and-is-debating-which-ones-to-accept-ninja-needs-a-15-minute-break-between-appointments-and-therefore-he-cannot-accept-any-adjacent-requests\">Ninja has recently started a startup. In his startup, there is only one conference room for a meeting. Ninja receives an array/list ‘MEETINGS’ of back-to-back appointment requests and is debating which ones to accept. Ninja needs a 15-minute break between appointments, and therefore he cannot accept any adjacent requests.</h4>\n\n<h4 id=\"ninja-has-to-find-the-highest-total-booked-minutes-in-the-conference-room-for-all-meetings\">Ninja has to find the highest total booked minutes in the conference room for all meetings.</h4>\n\n<h4 id=\"note-all-meeting-timings-are-multiples-of-15\">Note: All meeting timings are multiples of 15.</h4>\n\n<h4 id=\"for-example\">For example:</h4>\n\n<pre><code>‘MEETINGS[]’ = {30, 15, 60}\n\nLet us assume the meeting starts at 12:00 o’clock.\nThe first meeting takes 30 minutes so after the first meeting time is 12:30.\nThen Ninja cannot attend the second meeting which is for 15 minutes because he needs 15 minutes break after every meeting.\nAfter a 15 minutes break, he can attend the next meeting which is for 60 minutes.\n\nSo the total booked minutes for the meetings is 30 + 60 = 90.\n</code></pre>\n\n<h5 id=\"input-format\">Input Format</h5>\n\n<pre><code>The first line of input contains an integer ‘T’ which denotes the number of test cases or queries to be run. Then the test cases follow.\n\nThe first line of each test case contains an integer ‘N’ represents the number of meetings.\n\nThe next line of each test case contains ‘N’ single space-separated integers denoting the time taken by a meeting.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format :</h5>\n\n<pre><code>For each test case, return the number of minutes for all meetings which are scheduled.\n\nPrint the output of each test case in a separate line.\n</code></pre>\n\n<h5 id=\"note\">Note:</h5>\n\n<pre><code>You do not need to print anything; it has already been taken care of. Just implement the given function.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints:</h5>\n\n<pre><code>1 &lt;= ‘T’ &lt;= 10^2\n1 &lt;= ‘N’ &lt;= 5*10^3\n0 &lt;= ‘MEETINGS[i]’ &lt;= 10^5 {each multiple of 15}\n\nTime Limit: 1 second\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1:</h5>\n\n<pre><code>1\n8\n30 15 60 75 45 15 15 45\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1:</h5>\n\n<pre><code>180\n</code></pre>\n\n<h4 id=\"explanation-for-sample-output-1\">Explanation for Sample Output 1:</h4>\n\n<pre><code>For sample test case 1: \n\nLet’s assume the first meeting starts at 12:00 o’clock.\nThen, the first meeting takes 30 minutes, so after the first meeting, the time is 12:30.\nThen Ninja cannot attend the second meeting which is for 15 minutes because he needs a 15 minutes break after every meeting. So after a 15 minutes break, the time is 12:45.\nThen he attends the third meeting which is for 60 minutes, so after the third meeting, the time is 13:45.\nNow he cannot attend the fourth meeting which is for 75 minutes because he needs a 15 minutes break after every meeting. We know the fifth meeting starts after 75 minutes because the allocated time for the fourth meeting is 75 minutes. So after 75 minutes, the time is 15:00.\nThen he attends the fifth meeting which is for 45 minutes, so after the third meeting, the time is 15:45.\nNow he cannot attend the sixth meeting which is for 15 minutes because he needs a 15 minutes break after every meeting. So after a 15 minutes break, the time is 16:00.\nThen he skips the seventh meeting also, which is for 15 minutes, so after the seventh meeting, the time is 16:15.\nThen he attends the eighth meeting which is for 45 minutes, so after the eighth meeting, the time is 17:00.\n\nSo Ninja attended the first, third, fifth, eighth meeting. \nHence the total minutes are: 30 + 60 + 45 + 45 = 180.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2:</h5>\n\n<pre><code>1\n4\n60 15 15 60\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2:</h5>\n\n<pre><code>120\n</code></pre>\n\n<h4 id=\"explanation-for-sample-output-2\">Explanation for Sample Output 2:</h4>\n\n<pre><code>For sample test case 1: \n\nLet’s assume the first meeting starts at 12:00 o’clock.\nThen, the first meeting takes 60 minutes, so after the first meeting, the time is 13:00.\nThen he cannot attend the second meeting which is for 15 minutes because he needs 15 minutes to break after every meeting. So after a 15 minutes break, the time is 13:15.\nThen he skips the third meeting also, which is for 15 minutes, so after the third meeting, the time is 13:30.\nThen he attends the fourth meeting which is for 60 minutes, so after the fourth meeting, the time is 14:30.\n\nSo he attended the first and the fourth meeting.  \nHence the total minutes are: 60 + 60 = 120.\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Medium",
            "likes": 1,
            "dislikes": "NA",
            "rephrased": {
                "body": "Ninja is scheduling meetings in a conference room. Given an array of meeting durations, find the maximum total meeting time Ninja can book, considering he needs a 15-minute break between meetings, thus cannot accept adjacent requests.",
                "constraints": [
                    "1 <= ‘T’ <= 10^2",
                    "1 <= ‘N’ <= 5*10^3",
                    "0 <= ‘MEETINGS[i]’ <= 10^5 {each multiple of 15}"
                ],
                "testcases": [
                    {
                        "input": "n = 8, meetings = [30, 15, 60, 75, 45, 15, 15, 45]",
                        "output": "180",
                        "explanation": "Ninja can attend meetings 1, 3, 5, and 8 with durations 30, 60, 45, and 45 respectively, resulting in a total of 180 minutes.  This avoids consecutive meetings due to the required 15-minute break."
                    },
                    {
                        "input": "n = 4, meetings = [60, 15, 15, 60]",
                        "output": "120",
                        "explanation": "Ninja can attend meetings 1 and 4 with durations 60 and 60 respectively, resulting in a total of 120 minutes. This is the optimal schedule considering the required breaks."
                    },
                    {
                        "input": "n = 3, meetings = [30, 15, 60]",
                        "output": "90",
                        "explanation": "Ninja can attend meetings 1 and 3, with durations 30 and 60, totaling 90 minutes. Attending meeting 2 is not possible due to the adjacent meetings rule."
                    },
                    {
                        "input": "n = 5, meetings = [15, 30, 45, 60, 75]",
                        "output": "120",
                        "explanation": "Ninja can attend meetings 1, 3 and 5, with durations 15, 45, and 75 minutes (15 + 45 + 60= 135). Ninja can also attend meeting 2 and 4 which would be 30 + 60 = 90 mins. Ninja can also attend meeting 1 ,4  which would be 15 + 60 = 75 mins. Optimal combination seems to be 1,3,5 which is 15 + 45 = 60 mins. So we can choose from  meeting 1,3,5 or meeting 2,4 or just a single meeting"
                    },
                    {
                        "input": "n = 1, meetings = [100]",
                        "output": "100",
                        "explanation": "With only one meeting, Ninja attends it, resulting in 100 minutes."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Think of the recursive approach.</p>",
            "<p>Think of a solution to optimize the previous approach by using memoization.</p>",
            "<p>Think of a solution to optimize the previous approach by using dynamic programming.</p>",
            "<p>Think of a solution to optimize the previous approach.</p>"
        ],
        "relatedTopics": [
            {
                "name": "Recursion",
                "slug": "recursion"
            },
            {
                "name": "Dynamic Programming",
                "slug": "dynamic-programming"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}