{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 10205,
            "title": "One Away",
            "titleSlug": "one-away_1171178",
            "content": "<h4 id=\"you-are-given-two-strings-string-a-and-string-b-your-task-is-to-determine-whether-string-a-can-be-transformed-into-string-b-by-performing-only-one-of-the-following-operations-at-most-one-or-maybe-zero-time\">You are given two strings, string A and string B. Your task is to determine whether string A can be transformed into string B by performing only one of the following operations at most one (or maybe zero)  time.</h4>\n\n<pre><code>1. You can delete a character from any position.\n2. You can replace a character with any other character.\n3. You can insert a character at any position. \n</code></pre>\n\n<h4 id=\"note\">Note :</h4>\n\n<pre><code>1. The strings are non-empty.\n2. The strings only contain lowercase English letters.\n</code></pre>\n\n<h5 id=\"input-format\">Input Format :</h5>\n\n<pre><code>The first line of the input contains an integer T denoting the number of test cases.\n\nThe first line of each test case contains a string A. \n\nThe second line of each test case contains a string B.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format :</h5>\n\n<pre><code>For each test case print in a new line, “True” if string A can be transformed into string B or “False” if this can’t be done.\n</code></pre>\n\n<h5 id=\"note\">Note :</h5>\n\n<pre><code>You do not need to print anything, it has already been taken care of. Just implement the given function.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints :</h5>\n\n<pre><code>1 &lt;= T &lt;= 100\n1 &lt;= |A| &lt;= 10^4\n1 &lt;= |B| &lt;= 10^4\n\nWhere where |A| represents the size of the string A and where |B| represents the size of the string B.\n\nTime Limit: 1sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1 :</h5>\n\n<pre><code>1\nabcde\nabcd\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1 :</h5>\n\n<pre><code>True\n</code></pre>\n\n<h5 id=\"explanation-for-sample-input-1\">Explanation For Sample Input 1 :</h5>\n\n<pre><code>For the strings “abcde” and “abcd”, we can observe that string B has one less character than the string A and all the characters of the strings are matching up to this length and in fact string A has one extra character. This means that we can simply delete this extra character and can get a string equal to the string B as the resultant string. Since we only used one of the operations only once, we can return “true”.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2 :</h5>\n\n<pre><code>1\nstbr\nstart\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2 :</h5>\n\n<pre><code>False\n</code></pre>\n\n<h5 id=\"explanation-for-sample-input-2\">Explanation For Sample Input 2 :</h5>\n\n<pre><code>For the strings “stbr” and “start”, we can observe that we require at least two operations to convert string A into string B. In one operation, we can replace ‘b’ with ‘a’ and we get “star” as the resultant string. This resultant string is not equal to the string B, “start”. We still need one more operation to convert it into string B. We can achieve this by adding ‘t’ to the resultant string so it will become “start”  But this would take two operations. So we print “false”. \n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Medium",
            "likes": 3,
            "dislikes": "NA",
            "rephrased": {
                "body": "Given two non-empty strings, A and B, consisting of lowercase English letters, determine if string A can be transformed into string B using at most one of the following operations:\n\n1.  Delete a character from any position.\n2.  Replace a character with any other character.\n3.  Insert a character at any position.",
                "constraints": [
                    "1 <= T <= 100",
                    "1 <= |A| <= 10^4",
                    "1 <= |B| <= 10^4",
                    "Strings A and B are non-empty.",
                    "Strings A and B contain only lowercase English letters.",
                    "Time Limit: 1 second"
                ],
                "testcases": [
                    {
                        "input": "abcde\nabcd",
                        "output": "True",
                        "explanation": "String A can be transformed into string B by deleting 'e'. This requires only one operation."
                    },
                    {
                        "input": "stbr\nstart",
                        "output": "False",
                        "explanation": "Transforming string A to string B requires at least two operations: replacing 'b' with 'a' and inserting 't'. Therefore, it is not possible using only one operation."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p><i>After performing an operation, the remaining substrings must be equal.</i></p>",
            "<p><i>Maintain one pointer for each string and compare the characters.</i></p>"
        ],
        "relatedTopics": [
            {
                "name": "Strings",
                "slug": "strings"
            },
            {
                "name": "Arrays",
                "slug": "arrays"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}