{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 9669,
            "title": "Predict the Winner",
            "titleSlug": "predict-the-winner_1072979",
            "content": "<h4 id=\"there-are-n-persons-standing-in-a-circular-queue-there-is-a-number-written-on-the-back-of-the-shirts-of-every-person-one-person-among-them-has-a-ball-in-his-hands-and-the-number-written-on-his-shirts-back-is-1-the-number-written-on-the-shirt-of-every-other-person-is-1-more-than-the-number-written-on-the-shirt-of-the-person-standing-to-the-left-of-him-we-have-also-been-provided-with-an-integer-k-denoting-the-jump-parameter-they-start-playing-a-game-the-game-proceeds-as-follows\">There are &#39;N&#39; persons standing in a circular queue. There is a number written on the back of the shirts of every person. One person among them has a ball in his hands and the number written on his shirt&#39;s back is 1. The number written on the shirt of every other person is 1 more than the number written on the shirt of the person standing to the left of him. We have also been provided with an integer &#39;K&#39; denoting the jump parameter. They start playing a game. The game proceeds as follows:</h4>\n\n<pre><code>1. If there is only one person remaining in the game then the game stops immediately and the person is declared the winner.\n2. The player who currently has the ball in its hand passes the ball to the person standing to his right. \n3. Step 2 happens exactly &#39;K&#39;-1 times.\n4. The game pauses here and the person who has the ball in his hand currently has to pass the ball to the person standing on his right and has to leave the game.\n5. Again the game resumes with the remaining players.\n</code></pre>\n\n<h4 id=\"you-have-been-provided-with-positive-integers-n-and-k-your-task-is-to-find-the-number-written-on-the-back-of-the-winner-when-the-game-is-played-with-n-members-using-the-jump-parameter-k\">You have been provided with positive integers &#39;N&#39; and &#39;K&#39;. Your task is to find the number written on the back of the winner when the game is played with &#39;N&#39; members using the jump parameter &#39;K&#39;.</h4>\n\n<h4 id=\"for-example\">For example:</h4>\n\n<pre><code>N=4, K=2 -&gt; K-1=1\n\nThe game starts with Person 1. He passes the ball to person 2. The game pauses here. Person 2 passes the ball to person 3 and leaves the game. Then the game resumes. Person 3 passes the ball to person 4. The game pauses here. Person 4 passes the ball to person 1 and leaves the game. Then the game resumes with person 1 having the ball in his hand. He passes the ball to person 3. The game pauses here. Person 3 passes the ball to person 1 and leaves the game. Now only person 1 remains and the game stops here.\n</code></pre>\n\n<h5 id=\"note\">Note</h5>\n\n<pre><code>You are not required to print anything, just implement the given function and return the number written on the shirt of the winner of the game.\n</code></pre>\n\n<h5 id=\"input-format\">Input format:</h5>\n\n<pre><code>The first line of input contains an integer ‘T’ denoting the number of test cases.\nThe next ‘2*T’ lines represent the ‘T’ test cases.\n\nThe first line of each test case contains an integer ‘N’ denoting the number of players in the game.\nThe second line of each test case contains an integer ‘K&#39; denoting the jump parameter in the game.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format</h5>\n\n<pre><code>For each test case, print the number written on the back of the winner when the game is played with &#39;N&#39; members using the jump parameter &#39;K&#39;.\n\nPrint the output of each test case in a separate line.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints:</h5>\n\n<pre><code>1 &lt;= T &lt;= 10\n1 &lt;= N &lt;= 10 ^ 5\n1 &lt;= K &lt;= 10 ^ 9\n\nTime limit: 1 second\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1:</h5>\n\n<pre><code>2\n5\n2\n4\n3\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1:</h5>\n\n<pre><code>3\n1\n</code></pre>\n\n<h5 id=\"explanation-of-sample-input-1\">Explanation of sample input 1:</h5>\n\n<pre><code>For the first test case:\nThe game starts with Person 1. He passes the ball to person 2. The game pauses here. Person 2 passes the ball to person 3 and leaves the game. Then the game resumes. Person 3 passes the ball to person 4. The game pauses here. Person 4 passes the ball to person 5 and leaves the game. Then the game resumes with person 5 having the ball in his hand. He passes the ball to person 1. The game pauses here. Person 1 passes the ball to person 3 and leaves the game. Then the game resumes with person 3 having the ball in his hand. He passes the ball to person 5. The game pauses here. Person 5 passes the ball to person 3 and leaves the game. Now only person 3 remains and the game stops here.\n\nHence, the winner of the game will be Person 3 and the answer will be 3.\n\nFor the second test case:\nThe game starts with Person 1. He passes the ball to person 2. Person 2 passes the ball to Person 3. The game pauses here. Person 3 passes the ball to Person 4 and leaves the game. Then the game resumes. Person 4 passes the ball to person 1. Person 1 passes the ball to person 2.The game pauses here. Person 2 passes the ball to person 4 and leaves the game. Then the game resumes with Person 4 having the ball in his hand. He passes the ball to person 1. Person 1 passes the ball to Person 4. The game pauses here. Person 4 passes the ball to person 1 and leaves the game. Now only person 1 remains and the game stops here.\n\nHence, the winner of the game will be Person 1 and the answer will be 1.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2:</h5>\n\n<pre><code>1\n4\n1\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2:</h5>\n\n<pre><code>4\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Medium",
            "likes": 11,
            "dislikes": "NA",
            "rephrased": {
                "body": "There are 'N' people in a circle, each with a unique number from 1 to N on their back. Person 1 starts with a ball. They play a game using a jump parameter 'K'.  The person with the ball passes it to the right 'K-1' times. Then, the person holding the ball passes it one more time to the right and leaves the circle. This repeats until only one person remains. Determine the number on the back of the winner.",
                "constraints": [
                    "1 <= T <= 10",
                    "1 <= N <= 10 ^ 5",
                    "1 <= K <= 10 ^ 9",
                    "Time limit: 1 second"
                ],
                "testcases": [
                    {
                        "input": "5\n2",
                        "output": "3",
                        "explanation": "With N=5 and K=2, the ball starts with Person 1. Round 1: Ball goes to 2, then 3 leaves. Round 2: Ball goes to 4, then 5 leaves. Round 3: Ball goes to 1, then 3 leaves. Round 4: Ball goes to 5, then 3 leaves,leaving 3 as the winner."
                    },
                    {
                        "input": "4\n3",
                        "output": "1",
                        "explanation": "With N=4 and K=3, the ball starts with Person 1.  Round 1: Ball goes to 2, then 3, then 4 leaves. Round 2: Ball goes to 1, then 2, then 4 leaves. Round 3: Ball goes to 4, then 1, then 4 leaves, leaving 1 as the winner."
                    },
                    {
                        "input": "4\n1",
                        "output": "4",
                        "explanation": "With N=4 and K=1, each round, the person with the ball immediately passes it to the next and leaves. Person 1 passes to 2 and leaves. Person 2 passes to 3 and leaves. Person 3 passes to 4 and leaves. 4 is the winner"
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Try to simulate the game and find its winner.</p>",
            "<p>Think of a recursive approach to find out the winner of the game.</p>"
        ],
        "relatedTopics": [
            {
                "name": "Stacks & Queues",
                "slug": "stacks-&-queues"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}