{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 9170,
            "title": "Prime Adjacent ",
            "titleSlug": "prime-adjacent_977245",
            "content": "<h4 id=\"a-prime-adjacent-is-a-number-that-is-adjacent-to-two-prime-numbers-two-numbers-are-considered-adjacent-to-each-other-if-the-absolute-difference-between-them-is-1\">A prime adjacent is a number that is adjacent to two prime numbers. Two numbers are considered adjacent to each other if the absolute difference between them is 1.</h4>\n\n<h5 id=\"for-example\">For Example:</h5>\n\n<pre><code>4 is a prime adjacent because it is adjacent to the numbers 3 and 5, which are prime numbers.\n</code></pre>\n\n<h4 id=\"your-task-is-to-find-out-if-the-number-given-to-you-is-prime-adjacent-or-not\">Your task is to find out if the number given to you is prime adjacent or not.</h4>\n\n<h5 id=\"input-format\">Input Format :</h5>\n\n<pre><code>The first line contains an integer &#39;T&#39; which denotes the number of test cases or queries to be run. Then, the T test cases follow.\n\nThe first and only line of each test case or query contains an integer N.\n</code></pre>\n\n<h5 id=\"output-format\">Output format:</h5>\n\n<pre><code>For each test case, print “Yes” if N is prime adjacent, otherwise print “No” (without inverted commas), in a separate line.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints:</h5>\n\n<pre><code>1 &lt;= T &lt;= 1000\n2 &lt;= N &lt;= 10^6\n\nTime limit: 1 sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1:</h5>\n\n<pre><code>2\n4 \n2\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1 :</h5>\n\n<pre><code>Yes\nNo\n</code></pre>\n\n<h5 id=\"explanation\">Explanation :</h5>\n\n<pre><code>For test case 1:\n4 is a prime adjacent because its adjacent numbers, 3 and 5 are prime numbers.\n\nFor test case 2:\nIn case of 2, the adjacent numbers are 1 and 3, out of which 1 is not prime but 3 is     \nprime. \n\nBy definition, a number is a prime adjacent only if both of its adjacent numbers are prime numbers. So, 2 is not a prime adjacent.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2:</h5>\n\n<pre><code>3\n3 \n18\n25\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2 :</h5>\n\n<pre><code>No\nYes\nNo\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Medium",
            "likes": -8,
            "dislikes": "NA",
            "rephrased": {
                "body": "A prime-adjacent number is a number whose immediate neighbors (numbers differing by 1) are both prime numbers. Given an integer, determine if it is a prime-adjacent number.",
                "constraints": [
                    "1 <= T <= 1000",
                    "2 <= N <= 10^6",
                    "Time limit: 1 sec"
                ],
                "testcases": [
                    {
                        "input": "2\n4\n2",
                        "output": "Yes\nNo",
                        "explanation": "For the first test case, the number is 4. Its neighbors are 3 and 5. Both 3 and 5 are prime numbers, therefore, 4 is a prime-adjacent number.\n\nFor the second test case, the number is 2. Its neighbors are 1 and 3. While 3 is prime, 1 is not prime. Therefore, 2 is not a prime-adjacent number."
                    },
                    {
                        "input": "3\n3\n18\n25",
                        "output": "No\nYes\nNo",
                        "explanation": "For the first test case, the number is 3. Its neighbors are 2 and 4. 2 is prime, but 4 is not. So, 3 is not a prime-adjacent number.\n\nFor the second test case, the number is 18. Its neighbors are 17 and 19, both prime. Hence, 18 is a prime-adjacent number.\n\nFor the third test case, the number is 25. Its neighbors are 24 and 26, and neither are prime, therefore, 25 is not a prime-adjacent number."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>The very first approach can be to check whether the number N-1 and the number N+1 are prime or not. The idea is to use recursion for this task.</p>",
            "<p>The very first approach can be to check whether the number N-1 and the number N+1 are prime or not. Let’s do the same iteratively.</p>",
            "<p>Initially, we were checking with all numbers smaller than N-1 to see if N-1 is divisible by any number or not. But, is it necessary?&nbsp;</p><p>&nbsp;</p><p>If we look carefully, any nonprime number<strong> c </strong>can be represented as the product of two numbers <strong>a </strong>and <strong>b</strong>, such that <strong>a * b = c</strong>. So, if one factor, say <strong>b </strong>increases then the other factor, say decreases, So, the idea is to find a range and then look for <strong>a </strong>in that range.</p>",
            "<p>The idea is to precompute all prime numbers up to a limit using the Sieve of Eratosthenes algorithm. After applying sieve, our only task is to check for adjacent numbers of the given number N, if both the adjacent numbers of N are prime, then, N is prime adjacent.</p>"
        ],
        "relatedTopics": [
            {
                "name": "Number Theory",
                "slug": "number-theory"
            },
            {
                "name": "Recursion",
                "slug": "recursion"
            }
        ],
        "solutions": [],
        "platform": "CODESTUDIO"
    }
}