{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 12273,
            "title": "Sort Items by Group",
            "titleSlug": "sort-items-by-group_1404700",
            "content": "<h4 id=\"you-are-given-n-items-each-item-either-doesn-t-belong-to-any-group-or-belongs-to-exactly-one-group-out-of-m-groups-for-each-item-you-are-also-given-a-list-before-containing-items-that-should-appear-before-this-item-in-the-final-sorted-list\">You are given ‘N’ items. Each item either doesn’t belong to any group or belongs to exactly one group out of ‘M’ groups. For each item, you are also given a list, ‘BEFORE’, containing items that should appear before this item in the final sorted list.</h4>\n\n<h4 id=\"your-task-is-to-sort-these-items-in-an-order-which-follows-the-following-rules\">Your task is to sort these items in an order which follows the following rules :</h4>\n\n<pre><code>The items belonging to the same group must be ordered adjacent to each other.\nThe item which does not belong to any group can be placed anywhere. \nEach item appearing in BEFORE[i] must be placed before the ith item in the sorted list.\n</code></pre>\n\n<h5 id=\"input-format\">Input Format :</h5>\n\n<pre><code>The first line contains an integer ‘T’, which denotes the number of test cases to be run. Then, the T test cases follow. \n\nThe first line of each test case contains two space-separated integers, ‘N’ and ‘M’, denoting the number of items and the number of groups respectively. \n\nThe second line of each test case contains ‘N’ space-separated integers, where every ith integer denotes the group to which the ith item belongs. If an item does not belong to any group, “-1” is used at its place.\n\nThen ‘N’ lines follow, and each of these lines contains the following :\n\nAn integer ‘X’ denoting the number of items that should be placed before the ith item. Then X space-separated integers follow. Each integer, ‘Y’ denotes the item number that should be placed before the ith item\n</code></pre>\n\n<h5 id=\"output-format\">Output Format :</h5>\n\n<pre><code>For each test case, print ‘N’ space-separated integers, denoting the items in the required order.\n\nIf there is no order of items that can match all the requirements, print a single integer “-1”.\n\nOutput for each test case will be printed in a separate line.\n</code></pre>\n\n<h5 id=\"note\">Note :</h5>\n\n<pre><code>You do not need to print anything. It has already been taken care of. Just implement the given function.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints :</h5>\n\n<pre><code>1 &lt;= T &lt;= 10\n1 &lt;= N,M &lt;= 10^5\n-1 &lt;= GROUP[I] &lt;= M-1\n0 &lt;= X &lt;= N-1\n0 &lt;= Y &lt;= N-1\n\nWhere ‘GROUP[i]’ is the group to which the ith item belongs.\n\nTime Limit: 1 sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1 :</h5>\n\n<pre><code>1\n4 2\n-1 0 1 0\n2 1 2\n0\n2 1 3\n1 1\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1 :</h5>\n\n<pre><code>1 3 2 0\n</code></pre>\n\n<h5 id=\"explanation-for-sample-input-1\">Explanation For Sample Input 1 :</h5>\n\n<p><img src=\"https://files.codingninjas.in/untitled-diagram-6-8932.png\" alt=\"\"></p>\n\n<pre><code>In this test case, we can observe that item 0 does not belong to any group while item 1 and item 3 belong to group 0 and item 2 belong to group 1. We also need to consider that item 1 and item 2 should come before item 0. While item 1 and item 3 should come before item 2. While item 1 should come before item 3. We can observe that all these requirements are being met in the given output.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2 :</h5>\n\n<pre><code>1\n5 3\n1 2 0 1 0\n2 1 3\n0\n2 1 3\n0\n0\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2 :</h5>\n\n<pre><code>1 3 0 2 4\n</code></pre>\n\n<h5 id=\"explanation-for-sample-input-2\">Explanation For Sample Input 2 :</h5>\n\n<p><img src=\"https://files.codingninjas.in/untitled-diagram-7-8933.png\" alt=\"\"></p>\n\n<pre><code>In this test case, we can observe that item 2 and item 4 belong to group 0 and item 1 belongs to group 2. Item 2 and item 4 belong to group 0. We also need to consider that item 1 and item 3 should come before item 0 and item 2. We can observe that all these requirements are being met in the given output.\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Medium",
            "likes": -7,
            "dislikes": "NA",
            "rephrased": {
                "body": "You are given 'N' items. Each item either doesn’t belong to any group or belongs to exactly one group out of 'M' groups. For each item, you are also given a list, 'BEFORE', containing items that should appear before this item in the final sorted list.\n\nYour task is to sort these items in an order that satisfies the following conditions:\n\n1.  Items belonging to the same group must be placed adjacent to each other.\n2.  Items that do not belong to any group can be placed anywhere.\n3.  For each item i, all items in BEFORE[i] must appear before item i in the sorted list.\n\nIf a valid sorted order exists, return it as a list of item indices. If no such order is possible, return -1.",
                "constraints": [
                    "1 <= T <= 10",
                    "1 <= N, M <= 10^5",
                    "-1 <= GROUP[I] <= M-1",
                    "0 <= X <= N-1",
                    "0 <= Y <= N-1",
                    "Where ‘GROUP[i]’ is the group to which the ith item belongs.",
                    "Time Limit: 1 sec"
                ],
                "testcases": [
                    {
                        "input": "1\n4 2\n-1 0 1 0\n2 1 2\n0\n2 1 3\n1 1",
                        "output": "1 3 2 0",
                        "explanation": "Item 0 does not belong to any group, items 1 and 3 belong to group 0, and item 2 belongs to group 1. The constraints are:\n\n*   Items 1 and 2 must come before item 0.\n*   Items 1 and 3 must come before item 2.\n*   Item 1 must come before item 3.\n\nThe output `1 3 2 0` satisfies all these conditions. Item 1 and 3 are in same group so are beside each other and before item 2 (which is in other group.)"
                    },
                    {
                        "input": "1\n5 3\n1 2 0 1 0\n2 1 3\n0\n2 1 3\n0\n0",
                        "output": "1 3 0 2 4",
                        "explanation": "Items 2 and 4 belong to group 0, and item 1 belongs to group 2.  The constraints are:\n\n*   Items 1 and 3 must come before items 0 and 2.\n\nThe output `1 3 0 2 4` satisfies all these conditions. 0 and 2 are in same group and beside each other."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Think about Topological Sorting</p>"
        ],
        "relatedTopics": [
            {
                "name": "Depth-first Search",
                "slug": "depth-first-search"
            },
            {
                "name": "Graph",
                "slug": "graph"
            }
        ],
        "solutions": [],
        "platform": "CODESTUDIO"
    }
}