{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 10321,
            "title": "Two Squares",
            "titleSlug": "two-squares_1214552",
            "content": "<h4 id=\"you-are-given-two-squares-on-a-two-dimensional-plane-the-sides-of-the-squares-are-parallel-to-the-x-and-y-axis-your-task-is-to-find-a-line-that-would-cut-these-two-squares-in-exactly-half-by-exactly-half-we-mean-the-line-should-cut-the-square-in-two-parts-such-that-the-area-of-both-the-parts-is-exactly-the-same\">You are given two squares on a two-dimensional plane. The sides of the squares are parallel to the X and Y-axis. Your task is to find a line that would cut these two squares in exactly half. By exactly half, we mean the line should cut the square in two parts such that the area of both the parts is exactly the same.</h4>\n\n<h4 id=\"each-square-is-represented-by-an-array-of-four-points-where-each-point-has-two-integers-denoting-the-x-coordinate-and-the-y-coordinate-respectively-so-your-task-is-to-return-an-array-of-two-numbers-of-type-double-where-the-first-number-represents-the-slope-and-the-second-number-represents-the-y-intercept-of-the-line-if-such-a-line-doesn-t-exist-or-multiple-such-lines-exist-then-return-1-1-if-the-line-is-parallel-to-the-y-axis-then-return-0-0\">Each square is represented by an array of four points, where each point has two integers denoting the x-coordinate and the y-coordinate, respectively. So, your task is to return an array of two numbers of type double, where the first number represents the slope, and the second number represents the y-intercept of the line. If such a line doesn’t exist, or multiple such lines exist, then return {-1, -1}. If the line is parallel to the Y-axis, then return {0,0}.</h4>\n\n<h5 id=\"for-example\">For Example:</h5>\n\n<pre><code>If square s1 = {{0, 2}, {2, 2}, {2, 0}, {0, 0}} and square s2 = {{4, 2}, {6, 2}, {6, 0}, {4, 0}}.\n</code></pre>\n\n<p><img src=\"https://files.codingninjas.in/squaresexample-8103.png\" alt=\"squares\"></p>\n\n<pre><code>So, the two squares are shown in the above figure. The line that would cut these two squares in half has the equation y = 1. So the slope of the line is 0, and the y-intercept is 1. So, we return {0, 1} as the answer.\n</code></pre>\n\n<h5 id=\"input-format\">Input format:</h5>\n\n<pre><code>The first line contains an integer ‘T&#39;, which denotes the number of test cases or queries to be run. Then, the T test cases follow.\n\nFour lines follow. Each line contains two space-separated integers, denoting the x and y-coordinates of vertices of the square s1 in clockwise order starting from the top left corner.\n\nThen the next four lines follow. Each line contains two space-separated integers, denoting the x and y-coordinates of vertices of the square s2 in clockwise order.\nFor more clarity, please refer to the sample inputs.\n</code></pre>\n\n<h5 id=\"output-format\">Output format:</h5>\n\n<pre><code>For each test case, print a single line containing two space-separated numbers of type doubles denoting the slope and the y-intercept of the line, respectively, that would cut the squares in exactly half. \n\nYour answer will be considered correct if the absolute or relative error of the numbers doesn’t exceed 10^-6.\n\nThe output for each test case will be printed in a separate line.\n</code></pre>\n\n<h5 id=\"note\">Note:</h5>\n\n<pre><code>You do not need to print anything. It has already been taken care of. Just implement the given function.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints:</h5>\n\n<pre><code>1 &lt;= T &lt;= 5000\n-100 &lt;= x-coordinate, y-coordinate of both squares &lt;= 100\n\nTime limit: 1 second\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1:</h5>\n\n<pre><code>2\n-1 1\n1 1\n1 -1\n-1 -1\n1 3\n3 3\n3 1\n1 1\n0 5\n5 5\n5 0\n0 0\n0 5\n5 5\n5 0\n0 0    \n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1:</h5>\n\n<pre><code>1 0\n-1 -1\n</code></pre>\n\n<h5 id=\"explanation-for-sample-1\">Explanation for sample 1:</h5>\n\n<pre><code>For the first test case, the two squares and the line that would cut them in half are shown in the below figure.\n</code></pre>\n\n<p><img src=\"https://files.codingninjas.in/squares_input1_ex1-8104.png\" alt=\"squares\"></p>\n\n<pre><code>So, the equation of the line is y = x. The slope of the line is 1, and the y-intercept is 0.\n\n\nFor the second test case, the two squares and the line that would cut them in half are shown in the below figure.\n</code></pre>\n\n<p><img src=\"https://files.codingninjas.in/squares_input1_ex2-8105.png\" alt=\"squares\"></p>\n\n<pre><code>Since both the squares are exactly the same in this case; hence, there exist infinitely many lines that cut the squares in exactly half with respect to the area. So, the answer is {-1, -1}.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2:</h5>\n\n<pre><code>2\n-2 -2\n-2 0\n0 0\n0 -2\n3 1\n3 3\n5 3\n5 1\n-2 -2\n-2 2\n2 2\n2 -2\n-2 2\n-2 6\n2 6\n2 2   \n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2:</h5>\n\n<pre><code>0.6 -0.4\n0 0\n</code></pre>\n\n<h5 id=\"explanation-for-sample-2\">Explanation for sample 2:</h5>\n\n<pre><code>For the first test case, the centres are (-1, -1) and (4, 2).\nFor the second test case, the centres are (0, 0) and (0, 4). Since this line is parallel to the Y-axis, so we return {0, 0}.\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Medium",
            "likes": -9,
            "dislikes": "NA",
            "rephrased": {
                "body": "You are given two squares on a two-dimensional plane. The sides of the squares are parallel to the X and Y-axis. Your task is to find a line that would cut these two squares in exactly half, meaning the line should divide each square into two parts with equal areas.\n\nEach square is represented by an array of four points, where each point has two integers representing the x and y coordinates, respectively. You need to return an array of two numbers of type double, representing the slope and y-intercept of the line. If no such line exists or multiple lines exist, return {-1, -1}. If the line is parallel to the Y-axis, return {0, 0}.",
                "constraints": [
                    "1 <= T <= 5000",
                    "-100 <= x-coordinate, y-coordinate of both squares <= 100",
                    "Time limit: 1 second"
                ],
                "testcases": [
                    {
                        "input": "-1 1\n1 1\n1 -1\n-1 -1\n1 3\n3 3\n3 1\n1 1\n0 5\n5 5\n5 0\n0 0\n0 5\n5 5\n5 0\n0 0",
                        "output": "1 0\n-1 -1",
                        "explanation": "In the first case, the line y = x cuts both squares in half. Hence the slope is 1 and y-intercept is 0.\nIn the second case, the two squares are identical, so infinitely many lines can cut them in half. Therefore, the answer is {-1, -1}."
                    },
                    {
                        "input": "-2 -2\n-2 0\n0 0\n0 -2\n3 1\n3 3\n5 3\n5 1\n-2 -2\n-2 2\n2 2\n2 -2\n-2 2\n-2 6\n2 6\n2 2",
                        "output": "0.6 -0.4\n0 0",
                        "explanation": "In the first case, the centers of the squares are (-1, -1) and (4, 2). The slope and intercept are 0.6 and -0.4 respectively.\nIn the second case, the centers of the squares are (0, 0) and (0, 4). Since the line connecting the centers is parallel to the Y-axis, the answer is {0, 0}."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>The line that passes through the centre of the two squares will cut the squares in half.</p>"
        ],
        "relatedTopics": [
            {
                "name": "Math",
                "slug": "math"
            },
            {
                "name": "Number Theory",
                "slug": "number-theory"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}