{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 14789,
            "title": "Watering Flowers",
            "titleSlug": "watering-flowers_2264968",
            "content": "<h4 id=\"takahashi-has-a-garden-with-n-beautiful-flowers-in-a-row-he-waters-exactly-arr-i-liters-of-water-to-ith-flowers-from-left-to-right-daily-to-keep-them-beautiful-he-has-a-container-that-can-contain-k-liters-of-water-but-he-follows-certain-rules-to-water-all-the-plants\">Takahashi has a garden with ‘n’ beautiful flowers in a row. He waters exactly “arr[i]” liters of water to ith flowers from left to right daily to keep them beautiful. He has a container that can contain ‘k’ liters of water. But he follows certain rules to water all the plants:</h4>\n\n<pre><code>Water a plant if he has sufficient water in the container, otherwise refill it.\n\nYou can only refill at the water tank which is placed one step before the first flower.\n</code></pre>\n\n<h4 id=\"takahashi-wants-to-know-the-minimum-number-of-steps-he-needs-to-water-all-the-flowers\">Takahashi wants to know the minimum number of steps he needs to water all the flowers.</h4>\n\n<h5 id=\"for-example\">For Example :</h5>\n\n<pre><code>Let arr = {3, 5, 1, 2}, k = 6\n\nNow in this example, he will first move to the first flower and water it. Now his container contains only 3 liters of water, hence he will refill the container, so he goes 1 step back and refills, comes to the 2nd flower, after watering the second flower, he still has 1 liter of water and 1 flower left. So he will water that flower and return to refill. Now he will come to the last flower and water it. \nHence the total steps taken are: 1 + 1 + 2 + 1 + 3 + 4 = 12.\n</code></pre>\n\n<h5 id=\"input-format\">Input Format :</h5>\n\n<pre><code>The first line contains a single integer ‘T’ denoting the number of test cases to be run. Then the test cases follow.\n\nThe first line of each test case contains two integers ‘n’ and ‘k’, denoting the number of flowers and capacity of the container, respectively.\n\nThe second line of the test case contains an array “arr” of size ‘n’, where “arr[i]” denotes the amount of water needed to the ith flower.\n</code></pre>\n\n<h5 id=\"output-format\">Output Format :</h5>\n\n<pre><code>For each test case, print a single integer “answer” denoting the total steps taken by Takahashi.\n\nOutput for each test case will be printed in a separate line.\n</code></pre>\n\n<h5 id=\"note\">Note :</h5>\n\n<pre><code>You are not required to print anything; it has already been taken care of. Just implement the function and return the answer.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints :</h5>\n\n<pre><code>1 &lt;= T &lt;= 100\n1 &lt;= N &lt;= 10^4\n1 &lt;= k &lt;= 10^5\n1 &lt;= arr[i] &lt;= k\nTime limit: 1 sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1 :</h5>\n\n<pre><code>2\n3 11\n3 2 5\n3 5\n4 2 1\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1 :</h5>\n\n<pre><code>3\n5\n</code></pre>\n\n<h5 id=\"explanation-for-sample-output-1\">Explanation For Sample Output 1 :</h5>\n\n<p><img src=\"https://files.codingninjas.in/watering_flower_st1-12524.png\"/></p>\n\n<pre><code>In the first example, he will first move to the first flower and water it, after that he is left with 8 liters of water, now he will move to the second flower and water it, after watering it he is still left with 6 liters of water which is enough for the third flower, so he will move to the third flower. Hence the total steps taken is 3.\n</code></pre>\n\n<p><img src=\"https://files.codingninjas.in/watering_flower_st2-12525.png\"/></p>\n\n<pre><code>In the second example, he will first move one step to water the first flower, now he is left with only one liter of water, so he will return to the water tank i.e. 1 step behind, and then come to the second flower, water it and move to the third flower, hence the total steps taken are 5.\n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2 :</h5>\n\n<pre><code>2\n5 9\n4 7 2 6 1\n5 1\n1 1 1 1 1    \n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2 :</h5>\n\n<pre><code>13\n25\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Easy",
            "likes": 28,
            "dislikes": "NA",
            "rephrased": {
                "body": "Takahashi has a garden with N flowers. He waters the i-th flower with arr[i] liters of water. He has a container with a capacity of K liters. He waters the flowers from left to right, refilling his container at the water tank (located one step before the first flower) whenever it's empty. Determine the minimum number of steps Takahashi needs to take to water all the flowers.",
                "constraints": [
                    "1 <= T <= 100",
                    "1 <= N <= 10^4",
                    "1 <= K <= 10^5",
                    "1 <= arr[i] <= K"
                ],
                "testcases": [
                    {
                        "input": "n = 3, k = 11, flowers = [3, 2, 5]",
                        "output": "3",
                        "explanation": "Takahashi waters the first flower (3 liters, 1 step), leaving 8 liters. He then waters the second flower (2 liters, 1 step), leaving 6 liters. He then waters the third flower (5 liters, 1 step). Total steps: 1 + 1 + 1 = 3."
                    },
                    {
                        "input": "n = 3, k = 5, flowers = [4, 2, 1]",
                        "output": "5",
                        "explanation": "Takahashi waters the first flower (4 liters, 1 step), leaving 1 liter. He refills (1 step back) and moves to the second flower (1 step), waters (2 liters), leaving 3 liters. He moves to the third flower (1 step), waters (1 liter), leaving 2 liters. Total steps: 1 + 1 + 1 + 1 + 1= 5."
                    },
                    {
                        "input": "n = 5, k = 9, flowers = [4, 7, 2, 6, 1]",
                        "output": "13",
                        "explanation": "Takahashi waters the first flower (4 liters, 1 step), leaving 5 liters. He refills (1 step back) comes back to second flower( 1 step), water the second flower (7 liters) now remaining 2 liters. Refills (1 step back) comes back to third flower( 1 step) water the third flower (2 liters, 1 step).now remaining 7 liters. comes back to fourth flower(1 step),waters the fourth flower (6 liters, 1 step)now remaining 1 liter. comes back to fifth flower(1 step),waters the fifth flower (1 liters, 1 step) Total steps: 1+ 1+ 1+ 1 + 1+ 1 + 1+ 1+ 1+ 1+ 1+1 +1 = 13."
                    },
                    {
                        "input": "n = 5, k = 1, flowers = [1, 1, 1, 1, 1]",
                        "output": "25",
                        "explanation": "Since the container can only hold 1 liter, Takahashi must refill after watering each flower. The steps are: 1 (to flower) + 1 (refill) repeated 5 times, plus the initial move to the first flower. So, (1+1)*5 = 10 *2 =20 + 5= 25"
                    },
                    {
                        "input": "n = 4, k = 6, flowers = [3, 5, 1, 2]",
                        "output": "12",
                        "explanation": "Takahashi first moves to the first flower (1 step) and waters it, leaving 3 liters. Since he doesn't have enough for the second flower, he moves back to refill (1 step), making 6 liters again. He moves to the second flower (2 steps) and waters it, leaving 1 liter. He moves to the third flower (1 step) and waters it, leaving 0 liters.  He moves back to refill (1 step) making 6 litres again.He moves to the fourth flower (3 steps) and waters it.1+1+2+1+1+4=10. Oh no mistake.  Takahashi first moves to the first flower (1 step) and waters it, leaving 3 liters. Since he doesn't have enough for the second flower, he moves back to refill (1 step), making 6 liters again. He moves to the second flower (2 steps) and waters it, leaving 1 liter. He moves to the third flower (1 step) and waters it, leaving 0 liters. Then, moves to the fourth flower (1 step) and waters it. Oh no mistake. It must refills between third and fourth.   Takahashi first moves to the first flower (1 step) and waters it, leaving 3 liters. Since he doesn't have enough for the second flower, he moves back to refill (1 step), making 6 liters again. He moves to the second flower (2 steps) and waters it, leaving 1 liter. He moves to the third flower (1 step) and waters it, leaving 0 liters. Then moves back to refill. Again comes to fourth flower. 1 + 1 + 2+1+1+1+3= 10."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Iterate through the complete keyboard until we find the required character</p>"
        ],
        "relatedTopics": [
            {
                "name": "Arrays",
                "slug": "arrays"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}