{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 9415,
            "title": "Who Won the Election???",
            "titleSlug": "who-won-the-election_985277",
            "content": "<h4 id=\"elections-are-going-on-and-there-are-two-candidates-a-and-b-contesting-with-each-other-there-is-a-queue-of-voters-and-in-this-queue-some-of-them-are-supporters-of-a-and-some-of-them-are-supporters-of-b-many-of-them-are-neutral-the-fate-of-the-election-will-be-decided-on-which-side-the-neutral-voters-vote-supporters-of-a-and-supporters-of-b-make-attempts-to-win-the-votes-of-neutral-voters\">Elections are going on, and there are two candidates A and B, contesting with each other. There is a queue of voters and in this queue, some of them are supporters of A and some of them are supporters of B. Many of them are neutral. The fate of the election will be decided on which side the neutral voters vote. Supporters of A and supporters of B make attempts to win the votes of neutral voters.</h4>\n\n<h4 id=\"the-way-this-can-be-done-is-explained-below\">The way this can be done is explained below:</h4>\n\n<pre><code>1. The voter queue is denoted by three characters, viz {-, A, B}. The ‘-’ denotes neutral candidate, ‘A’ denotes supporter of candidate A and ‘B’ denotes supporter of candidate B.\n2. Supporters of A can only move towards the left side of the queue.\n3. Supporters of B can only move towards the right side of the queue.\n4. Since time is critical, supporters of both A and B will move simultaneously.\n5. They both will try and influence the neutral voters by moving in their direction in the queue. If a supporter of A reaches the neutral voter before a supporter of B reaches him, then that neutral voter will become a supporter of candidate A.\n6. Similarly, if a supporter of B reaches the neutral voter before supporter of A reaches him, then that neutral voter will become a supporter of candidate B.\n7. Finally, if both reach at the same time, the voter will remain neutral. A neutral vote cannot decide the outcome of the election.\n8. If finally, the queue has more votes for candidate A, then A wins the election. If B has more votes, then B wins that election. If both have equal votes, then it will be a coalition government.\n</code></pre>\n\n<h4 id=\"your-task-is-to-find-the-outcome-of-the-election\">Your task is to find the outcome of the election.</h4>\n\n<h5 id=\"for-example\">For Example:</h5>\n\n<pre><code>Given string- “B--A-”\n              B ---&gt;  B  A   &lt;--- A    B\n              -----------------------------&gt;\nOutput - B as B can move towards right only and A can move in left direction only. Thus B has 3 supporters in total while A have only 2 supporters. \n</code></pre>\n\n<h4 id=\"note\">Note:</h4>\n\n<pre><code>1. There are no test cases where all votes are neutral.\n2. The influenced voters do not move and hence does not have any influence over the neutral voters.\n</code></pre>\n\n<h5 id=\"input-format\">Input Format:</h5>\n\n<pre><code>The first line of the input contains a single integer T, representing the number of test cases. \n\nThe first line of each test case will contain the string having characters ‘A’, ‘B’ or ‘-’\n</code></pre>\n\n<h5 id=\"output-format\">Output Format:</h5>\n\n<pre><code>For each test case, you need to print ‘A’ if A wins the election, ‘B’ if B wins the election or ‘Coalition’ if both have equal votes.\n\nOutput for each test case will be printed in a separate line.\n</code></pre>\n\n<h5 id=\"note\">Note:</h5>\n\n<pre><code>You do not need to print anything. It has already been taken care of. Just implement the given function.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints:</h5>\n\n<pre><code>1 &lt;= T &lt;= 100\n1 &lt;= N &lt;= 10^4,\nWhere T is the number of testcases,\nand N is the length of the string.\n\nTime Limit: 1sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1:</h5>\n\n<pre><code>1\nB--A-\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1:</h5>\n\n<pre><code>B\n</code></pre>\n\n<h5 id=\"explanation-of-sample-input-1\">Explanation of Sample input 1:</h5>\n\n<pre><code>Initially, B is at the 0th position, and A is at the 3rd position. in one move, B will be at 1st position, while A will be at 2nd position. So B gained and A both gained one supporter. Finally, B gains an extra supporter at the 4th position, as A will never be able to travel at that position. so overall B supporters are 3, and A supporters are 2. Hence B&#39;s supporters will win.  \n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2:</h5>\n\n<pre><code>1\nB---A\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2:</h5>\n\n<pre><code>Coalition\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Medium",
            "likes": 7,
            "dislikes": "NA",
            "rephrased": {
                "body": "In an election, candidates A and B are vying for votes. A queue of voters consists of supporters of A ('A'), supporters of B ('B'), and neutral voters ('-'). Candidates A and B attempt to sway the neutral voters to their side. Supporters of A can only move towards the left, while supporters of B can only move towards the right. Supporters move simultaneously. A neutral voter will support a candidate if that candidate's supporter reaches them first. If both reach simultaneously, the voter remains neutral. Determine the election outcome based on the final vote count.",
                "constraints": [
                    "1 <= T <= 100, where T is the number of test cases.",
                    "1 <= N <= 10^4, where N is the length of the string.",
                    "There are no test cases where all votes are neutral."
                ],
                "testcases": [
                    {
                        "input": "voters = \"B--A-\"",
                        "output": "B",
                        "explanation": "Initially, B is at position 0 and A is at position 3. B influences the neutral voter at position 1 and A influences the neutral voter at position 2. The neutral voter at position 4 is influenced by B as A cannot move to the right. B ends up with 3 supporters and A with 2, so B wins."
                    },
                    {
                        "input": "voters = \"B---A\"",
                        "output": "Coalition",
                        "explanation": "Initially, B is at position 0 and A is at position 4. B influences the neutral voter at position 1. A influences the neutral voter at position 3. The neutral voter at position 2 remains neutral, since B and A reach at the same time. B ends up with 2 supporters and A with 2, resulting in a coalition."
                    },
                    {
                        "input": "voters = \"A--B\"",
                        "output": "Coalition",
                        "explanation": "A is at 0, B is at 3. A gets position 1 and B gets position 2. A and B each have 2 voters, resulting in a coalition."
                    },
                    {
                        "input": "voters = \"A-----\"",
                        "output": "A",
                        "explanation": "A is at position 0. A influences all neutral voters to the right. So, A wins."
                    },
                    {
                        "input": "voters = \"-----B\"",
                        "output": "B",
                        "explanation": "B is at position 5. B influences all neutral voters to the left. So, B wins."
                    },
                    {
                        "input": "voters = \"A-B\"",
                        "output": "Coalition",
                        "explanation": "A starts at 0. B starts at 2. The middle '-' is influenced by both simultaniously. So A has 1 voter and B has 1 voter."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Brute Force Approach.</p>",
            "<p>Maintain Count at Each Index using extra space.</p>"
        ],
        "relatedTopics": [
            {
                "name": "Strings",
                "slug": "strings"
            }
        ],
        "solutions": {},
        "platform": "CODESTUDIO"
    }
}