{
    "status": 200,
    "message": "Question Data fetched successfully",
    "data": {
        "question": {
            "questionFrontendId": 9415,
            "title": "Who Won the Election???",
            "titleSlug": "who-won-the-election_985277",
            "content": "<h4 id=\"elections-are-going-on-and-there-are-two-candidates-a-and-b-contesting-with-each-other-there-is-a-queue-of-voters-and-in-this-queue-some-of-them-are-supporters-of-a-and-some-of-them-are-supporters-of-b-many-of-them-are-neutral-the-fate-of-the-election-will-be-decided-on-which-side-the-neutral-voters-vote-supporters-of-a-and-supporters-of-b-make-attempts-to-win-the-votes-of-neutral-voters\">Elections are going on, and there are two candidates A and B, contesting with each other. There is a queue of voters and in this queue, some of them are supporters of A and some of them are supporters of B. Many of them are neutral. The fate of the election will be decided on which side the neutral voters vote. Supporters of A and supporters of B make attempts to win the votes of neutral voters.</h4>\n\n<h4 id=\"the-way-this-can-be-done-is-explained-below\">The way this can be done is explained below:</h4>\n\n<pre><code>1. The voter queue is denoted by three characters, viz {-, A, B}. The ‘-’ denotes neutral candidate, ‘A’ denotes supporter of candidate A and ‘B’ denotes supporter of candidate B.\n2. Supporters of A can only move towards the left side of the queue.\n3. Supporters of B can only move towards the right side of the queue.\n4. Since time is critical, supporters of both A and B will move simultaneously.\n5. They both will try and influence the neutral voters by moving in their direction in the queue. If a supporter of A reaches the neutral voter before a supporter of B reaches him, then that neutral voter will become a supporter of candidate A.\n6. Similarly, if a supporter of B reaches the neutral voter before supporter of A reaches him, then that neutral voter will become a supporter of candidate B.\n7. Finally, if both reach at the same time, the voter will remain neutral. A neutral vote cannot decide the outcome of the election.\n8. If finally, the queue has more votes for candidate A, then A wins the election. If B has more votes, then B wins that election. If both have equal votes, then it will be a coalition government.\n</code></pre>\n\n<h4 id=\"your-task-is-to-find-the-outcome-of-the-election\">Your task is to find the outcome of the election.</h4>\n\n<h5 id=\"for-example\">For Example:</h5>\n\n<pre><code>Given string- “B--A-”\n              B ---&gt;  B  A   &lt;--- A    B\n              -----------------------------&gt;\nOutput - B as B can move towards right only and A can move in left direction only. Thus B has 3 supporters in total while A have only 2 supporters. \n</code></pre>\n\n<h4 id=\"note\">Note:</h4>\n\n<pre><code>1. There are no test cases where all votes are neutral.\n2. The influenced voters do not move and hence does not have any influence over the neutral voters.\n</code></pre>\n\n<h5 id=\"input-format\">Input Format:</h5>\n\n<pre><code>The first line of the input contains a single integer T, representing the number of test cases. \n\nThe first line of each test case will contain the string having characters ‘A’, ‘B’ or ‘-’\n</code></pre>\n\n<h5 id=\"output-format\">Output Format:</h5>\n\n<pre><code>For each test case, you need to print ‘A’ if A wins the election, ‘B’ if B wins the election or ‘Coalition’ if both have equal votes.\n\nOutput for each test case will be printed in a separate line.\n</code></pre>\n\n<h5 id=\"note\">Note:</h5>\n\n<pre><code>You do not need to print anything. It has already been taken care of. Just implement the given function.\n</code></pre>\n\n<h5 id=\"constraints\">Constraints:</h5>\n\n<pre><code>1 &lt;= T &lt;= 100\n1 &lt;= N &lt;= 10^4,\nWhere T is the number of testcases,\nand N is the length of the string.\n\nTime Limit: 1sec\n</code></pre>\n<h5 id=\"sample-input-1\">Sample Input 1:</h5>\n\n<pre><code>1\nB--A-\n</code></pre>\n\n<h5 id=\"sample-output-1\">Sample Output 1:</h5>\n\n<pre><code>B\n</code></pre>\n\n<h5 id=\"explanation-of-sample-input-1\">Explanation of Sample input 1:</h5>\n\n<pre><code>Initially, B is at the 0th position, and A is at the 3rd position. in one move, B will be at 1st position, while A will be at 2nd position. So B gained and A both gained one supporter. Finally, B gains an extra supporter at the 4th position, as A will never be able to travel at that position. so overall B supporters are 3, and A supporters are 2. Hence B&#39;s supporters will win.  \n</code></pre>\n\n<h5 id=\"sample-input-2\">Sample Input 2:</h5>\n\n<pre><code>1\nB---A\n</code></pre>\n\n<h5 id=\"sample-output-2\">Sample Output 2:</h5>\n\n<pre><code>Coalition\n</code></pre>\n",
            "isPaidOnly": false,
            "difficulty": "Medium",
            "likes": 7,
            "dislikes": "NA",
            "rephrased": {
                "body": "Elections are underway between candidates A and B. A queue of voters exists, comprising supporters of A, supporters of B, and neutral voters. The election outcome hinges on which candidate the neutral voters favor. Supporters of A can only move left in the queue, while supporters of B can only move right. Both sides move simultaneously to influence neutral voters. A neutral voter becomes an A supporter if an A supporter reaches them first, a B supporter if a B supporter reaches them first, and remains neutral if they arrive simultaneously. The candidate with the most votes wins; equal votes result in a coalition.",
                "constraints": [
                    "1 <= T <= 100 (T is the number of test cases)",
                    "1 <= N <= 10^4 (N is the length of the string)",
                    "Time Limit: 1 second",
                    "There are no test cases where all votes are neutral."
                ],
                "testcases": [
                    {
                        "input": "B--A-",
                        "output": "B",
                        "explanation": "Initially, B is at index 0 and A is at index 3. B can influence the neutral voter at index 1 and A can influence the neutral voter at index 2. The neutral voter at index 4 can only be influenced by B. Thus, B has 3 supporters and A has 2, so B wins."
                    },
                    {
                        "input": "B---A",
                        "output": "Coalition",
                        "explanation": "Initially, B is at index 0 and A is at index 4. Both A and B reach the neutral voters in the middle at the same time, making them remain neutral. Thus, both A and B end up with two supporters each, resulting in a coalition."
                    }
                ]
            }
        },
        "similar": [],
        "hints": [
            "<p>Brute Force Approach.</p>",
            "<p>Maintain Count at Each Index using extra space.</p>"
        ],
        "relatedTopics": [
            {
                "name": "Strings",
                "slug": "strings"
            }
        ],
        "solutions": [],
        "platform": "CODESTUDIO"
    }
}